[
{
  "headline": "British Broadcasting Corporation",
  "url": "https://www.bbc.com/",
  "body": "37 mins agoMiddle East\nOnly from the BBC\nGlobal News Podcast\nFar-right Israeli minister Ben-Gvir prays at al-Aqsa mosque compound, angering Arabs\nIt comes amid reports that PM Netanyahu is pushing to expand Israel's military operations in Gaza.",
  "scraped_at": "2025-08-04T19:38:47.873630",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Hundreds of Israeli ex-officials appeal to Trump to help end Gaza war",
  "url": "https://www.bbc.com/news/articles/crkznje8nz8o",
  "body": "A group of some 600 retired Israeli security officials, including former heads of intelligence agencies, have written to US President Donald Trump to pressure Israel to immediately end the war in Gaza.\n\"It is our professional judgement that Hamas no longer poses a strategic threat to Israel,\" the officials said.\n\"Your credibility with the vast majority of Israelis augments your ability to steer Prime Minister [Benjamin] Netanyahu and his government in the right direction: End the war, return the hostages, stop the suffering,\" they wrote.\nTheir appeal comes amid reports that Netanyahu is pushing to expand military operations in Gaza as indirect ceasefire talks with Hamas have stalled.\nIsrael launched a devastating war in Gaza following Hamas's attack in southern Israel on 7 October 2023 in which about 1,200 people were killed and 251 taken into Gaza as hostages.\nMore than 60,000 people have been killed as a result of Israel's military campaign in Gaza since then, the Hamas-run health ministry says.\nOn Monday, the ministry reported that at least 94 people had been killed in Gaza in the past day, including dozens it said had died in Israeli strikes.\nAt least 24 people had been killed while seeking aid, it added. Such reports have become almost daily in recent months but are hard to verify as international journalists, including the BBC, are blocked by Israel from entering Gaza independently.\nThe territory is also experiencing mass deprivation as a result of heavy restrictions imposed by Israel on what is allowed into Gaza. The ministry says 180 people, including 93 children, have died from malnutrition since the start of the war.\nUN-backed agencies have said the \"worst-case scenario of famine is currently playing out\" in Gaza.\nThe latest intervention by the top former Israeli officials came after videos of two emaciated Israeli hostages were released by Hamas and Islamic Jihad militants.\nThe videos were widely condemned by Israeli and Western leaders.\nAfter the videos were released, Netanyahu spoke with the two hostage families, telling them that efforts to return all the hostages \"will continue constantly and relentlessly\".\nBut an Israeli official - widely quoted by local media - said Netanyahu was working to free the hostages through \"the military defeat of Hamas\".\nThe possibility of a new escalation in Gaza may further anger Israel's allies which have been pushing for an immediate ceasefire as reports of Palestinians dying from starvation or malnutrition cause shock around the world.\nThe main group supporting hostages' families condemned the idea of a new military offensive saying: \"Netanyahu is leading Israel and the hostages to doom.\"\nThat view was pointedly made in the letter to Trump by former Mossad chief Tamir Pardo, Ami Ayalon, former chief of Shin Bet - Israel's domestic secret service agency - former Prime Minister Ehud Barak, and former Defence Minister Moshe Yaalon among others.\n\"At first this war was a just war, a defensive war, but when we achieved all military objectives, this war ceased to be a just war,\" said Ayalon.\nThe former top leaders head the Commanders for Israel's Security (CIS) group, which has urged the government in the past to focus on securing the return of the hostages.\n\"Stop the Gaza War! On behalf of CIS, Israel's largest group of former IDF generals and Mossad, Shin Bet, Police, and Diplomatic Corps equivalents, we urge you to end the Gaza war. You did it in Lebanon. Time to do it in Gaza as well,\" they wrote to the US president.\nIsrael has faced growing international isolation, as the widespread destruction in Gaza and the suffering of Palestinians spark outrage.\nPolls around the world suggest that public opinion is increasingly negative about Israel, which is putting pressure on Western leaders to act.\nBut it is not clear what pressure, if any, Trump will choose to exert on the Israeli prime minister.\nThe US president has consistently backed his ally, even though he publicly acknowledged last week that there was \"real starvation\" in Gaza after Netanyahu insisted there was no such thing.",
  "scraped_at": "2025-08-04T19:38:50.071420",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Hackers, secret cables and security fears: The explosive fight over China's new embassy in the UK",
  "url": "https://www.bbc.com/news/articles/c3v3rygdrryo",
  "body": "The sheet of paper says \"Wanted Person\" at the top. Below is a photo of a young woman, a headshot that might have been taken in a studio. She looks directly at the camera, smiling with her teeth showing, and her dark, shoulder-length hair is neatly brushed.\nAt the bottom, in red, are the words: \"A reward of one million Hong Kong dollars,\" together with a UK phone number.\nTo earn the money, about £95,000, there is a simple instruction: \"Provide information on this wanted person and the related crime or take her to Chinese embassy\".\nThe woman from the photo is standing in front of me. She shudders when she looks at the building.\nWe are outside an imposing structure that was once home to the Royal Mint and which China hopes it can develop into a new mega-embassy in London, replacing the far smaller premises it has occupied since 1877.\nThe new premises, opposite the Tower of London, is already being patrolled by Chinese security guards. The building is ringed with CCTV cameras too.\n\"I've never been this close,\" admits Carmen Lau.\nCarmen, who is 30, fled Hong Kong in 2021 as pro-democracy activists in the territory were being arrested.\nShe argues that the UK should not allow China's \"authoritarian regime\" to have its new embassy in such a symbolic location. One of her fears is that China, with such a huge embassy, could harass political opponents and could even hold them in the building.\nThere are also worries, among some dissidents, that its location - very near London's financial district - could be an espionage risk. Then there is the opposition from residents who say it would pose a security risk to them.\nThe plans had previously been rejected by the local council, but the decision now lies with the government - and senior ministers have signalled they are in favour if minor adjustments are made to the plan.\nThe site is sprawling, at 20,000 square metres, and if it goes ahead it would mark the biggest embassy in Europe. But would it also really bring the dangers that its opponents fear?\nThe biggest embassy in Europe\nChina bought the old Royal Mint Court for £255m in 2018. The area has layer upon layer of history: across the road is the Tower, parts of it were built by William the Conqueror. For centuries kings and queens lived there.\nThe plan itself involves a cultural centre and housing for 200 staff, but in the basement, behind security doors, there are also rooms with no identified use on the plans.\n\"It's easy for me to imagine what would happen if I was taken to the Chinese embassy,\" says Carmen.\nIn 2022, a Hong Kong pro-democracy protester was dragged into the grounds of the Chinese consulate in Manchester and beaten. British police nearby stepped over the boundary to rescue him.\nBack in 2019, mass protests had erupted in Hong Kong, triggered by the government's attempt to bring in a new law allowing for Hong Kong citizens to be extradited to China.\nChina's response included a law that forced all elected officials in Hong Kong, including Carmen who was then a district councillor, to take an oath of loyalty to China. Carmen resigned instead.\nShe claims that journalists for Chinese state-run media started following her. The Ta Kung Pao newspaper, which is controlled by China's central government in Beijing, ran a front page story alleging she and her colleagues had held parties in their council offices.\n\"You know the tactics of the regime,\" she says. \"They were following you, trying to harass you. My friends and my colleagues were being arrested.\"\nCarmen fled to London but believes that she has continued to be targeted.\nHong Kong issued two arrest warrants for her alleging \"incitement to secession and collusion with a foreign country or with external elements to endanger national security\".\nThe bounty letter sent from Hong Kong to half a dozen of her neighbours followed.\n\"The regime just [tries] to eliminate any possible activists overseas,\" she says.\nSteve Tsang, a political scientist and historian who is director of the SOAS China Institute, says he can see why people from Hong Kong, or certain other backgrounds, may be uncomfortable with the new embassy.\nHe argues \"the Chinese government since 1949 does not have a record of kidnapping people and holding them in their embassy compounds.\"\nBut he says some embassy staff would be tasked with monitoring Chinese students and dissidents in the UK and they'd also target UK citizens, such as scientists, business people, and those with influence, to advance China's interests.\nThe Chinese embassy told the BBC it \"is committed to promoting understanding and the friendship between the Chinese and British peoples and the development of mutually beneficial cooperation between the two countries. Building the new embassy would help us better perform such responsibilities\".\nWarnings about espionage\nThere is another fear, held by some opponents, that the Royal Mint Court site could allow China to infiltrate the UK's financial system by tapping into fibre optic cables carrying sensitive data for firms in the City of London.\nThe site once housed Barclays Bank's trading floor, so it was wired directly into the UK's financial infrastructure. Nearby, a tunnel has, since 1985, carried fibre optic cables under the Thames serving hundreds of City firms.\nAnd in the grounds of the Court, is a five-storey brick building - the Wapping Telephone Exchange that serves the City of London.\nAccording to Prof Periklis Petropoulos, an optoelectronics researcher at Southampton University, direct access to a working telephone exchange could allow people to glean information.\nThis has all prompted warnings about potential espionage - including from Conservative frontbencher Kevin Hollinrake, as well as senior Republicans in the US.\nAn official with security experience in former US president Joe Biden's administration told me it's perfectly possible that cables could be tapped with devices that would capture passing information - and that this would be almost impossible to detect.\n\"Anything up to half a mile from the embassy would be vulnerable,\" he says.\nHowever, he argues that China may not be inclined to do this because it has other ways of hacking into systems.\nRegarding these concerns, the Chinese embassy said: \"Anti-China forces are using security risks as an excuse to interfere with the British government's consideration over this planning application.\n\"This is a despicable move that is unpopular and will not succeed.\"\nWhat the neighbours think\nAt the back of the Royal Mint Court is a row of 1980s-built flats. Mark Nygate has lived here for more than 20 years. He gestures across his low garden wall. \"Embassy staff will live there and overlook us,\" he says.\n\"We don't want [the embassy] there because of demonstrations, because of the security risks, because of our privacy.\"\nOpponents of the embassy - Hong Kongers, Tibetans, Uighurs, and opposition politicians - have already staged protests involving up to 6,000 people.\nMostly, though, he fears an attack on the embassy - that could harm him and his neighbours.\nBut Tony Travers, a visiting professor in the LSE Department of Government, lives near the current embassy and isn't convinced that these sorts of protests will materialise for the new neighbours, if the relocation goes ahead.\n\"I'm not aware of any evidence that there are regular protests that block the road outside the current Chinese embassy… self-evidently, there are much larger protests outside a number of other countries' embassies and high commissions.\"\nThe Chinese embassy in London says that the proposed development would \"greatly improve the surrounding environment and bring benefits to the local community and the district\".\nWhen President Xi raised the issue\nChina's first planning application to develop the site was rejected by Tower Hamlets council in 2022 over safety and security concerns - and fears protests and security measures could damage tourism.\nRather than amend the plan or appeal, China waited, then resubmitted an identical application in August 2024, one month after Labour came to power.\nOn 23 August, Sir Keir Starmer phoned Chinese President Xi Jinping for their first talks. Afterwards Sir Keir confirmed that Xi had raised the issue of the embassy.\nSince then, Deputy Prime Minister Angela Rayner has exercised her power to take the matter out of the council's hands, after being urged to do so by Foreign Secretary David Lammy.\nThis is in the context of an attempt by the government to engage with China after previous Conservative Prime Minister Rishi Sunak declared in 2022 that the so-called \"golden era\" of UK-China relations were over.\nFor his part, Prof Travers believes that politics is involved in planning decisions.\n\"The Secretary of State has to make the decision on the basis of the documentation in front of them and the law surrounding and affecting the issue,\" he argues.\n\"But it would be naïve to imagine that politics didn't play a role.\"\n'Kissing up to China'\nLord Peter Ricketts, a former diplomat who chaired the UK's National Security Council, advising prime ministers on global threats, stresses that the country's relationship with China is complex.\nA National Security Strategy published in June laid out the conflicting priorities in the government's approach, highlighting its desire to use the relationship to boost the UK economy but also likely \"continued tension\" over human rights and cyber security.\nBut is that duality of reaping the business benefits while pushing on the human rights transgressions, even possible?\n\"It is absolutely an adversary in some areas, which tries to steal our intellectual property, or suborn our citizens,\" says Lord Ricketts. \"(But) it is a commercial market, a very important one for us, and it's a player in the big global issues like climate and health.\n\"We have to be able to treat China in all those categories at the same time.\"\nThe embassy decision, he says, cuts to the heart of this. \"There are acute dilemmas, and there are choices to be made, whether to privilege the 30, 40 or 50-year relationship with China, which an embassy, I guess, would symbolise.\n\"Or whether to give priority to the short-term security threats, which are no doubt real as well.\"\nThe Conservative MP Sir Iain Duncan Smith is convinced giving the go-ahead for the new embassy would be a big mistake. \"They think that the only way they'll get growth is by kissing up to China and getting them to invest,\" he tells me.\nBut for all the concerns around security, having one big embassy could well make it easier to keep an eye on what Chinese officials are up to in the UK, according to Prof Tsang.\n\"Allowing the Chinese to put their staff on one site is preferable,\" he argues, \"because they're at the moment all over the place in London, you can't actually keep an eye on them.\"\nHe is not convinced that rejecting or approving the embassy will have an effect on business and trade.\n\"The Chinese are the absolute ultimate pragmatists. They are not going to suddenly say that no, we're not selling our best electric vehicles to you any longer just because you denied us the embassy,\" he says.\nBut, equally, \"they are not going to substantially increase Chinese investments in the UK because they have got the new embassy compound.\"\nIf Angela Rayner thinks that too, then her decision may well come down to how seriously she takes the warnings that China could eavesdrop on the UK's banks.\nIf she rejects the embassy it may be because she judges the danger it poses to be very real indeed.\nTop image credits: Reuters, Richard Baker via Getty Images, SOPA Images via Getty Images and EPA -EFE/REX/Shutterstock\nBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. And we showcase thought-provoking content from across BBC Sounds and iPlayer too. You can send us your feedback on the InDepth section by clicking on the button below.",
  "scraped_at": "2025-08-04T19:38:52.235796",
  "portal_name": "www.bbc.com"
},
{
  "headline": "India win all-time classic despite Woakes heroics",
  "url": "https://www.bbc.com/sport/cricket/articles/cx279ylegeyo",
  "body": "- Published\nFifth Rothesay Test, The Kia Oval (day five of five)\nIndia 224 (Nair 57, Atkinson 5-33, Tongue 3-57) & 396 (Jaiswal 118; Tongue 5-125)\nEngland 247 (Crawley 64; Krishna 4-62, Siraj 4-86) & 367 (Brook 111, Root 105; Siraj 5-104)\nIndia won by six runs; draw series 2-2\nEngland were denied a record-breaking run chase by an irresistible India, who snatched victory by six runs in one of the most dramatic conclusions in Test cricket history.\nIn scenes that will go down in British sporting folklore, Chris Woakes came out to bat with his arm in a sling to support Gus Atkinson when England needed 17 to reach their target of 374.\nWoakes was given a hero's welcome, then stood at the non-striker's end as Atkinson attempted to swipe England to victory.\nAmid almost unbearable tension at The Oval, Atkinson and Woakes somehow tried to inch England on, surrounded by the deafening din of the febrile Indian support.\nAfter Atkinson clobbered Mohammed Siraj for six, Woakes ran a bye to wicketkeeper Dhruv Jurel, who missed the stumps, in order for Atkinson to pinch the strike.\nIndia kept the field back. Prasidh Krishna bowled the next over. Woakes was able to run a two, then another vital single off the final ball to leave Atkinson with the strike.\nBut Atkinson was bowled by the brilliant Siraj, giving India their narrowest victory in terms of runs in a Test.\nIt left one of the greatest series ever played level at 2-2, concluding 25 days of outstanding sporting theatre.\nAt the end of a fractious series, India broke off from the delirious celebrations to commiserate with Woakes, then embarked on a lap of honour, soaking up a historic win with their jubilant fans.\n- Published29 minutes ago\nLion-hearted Woakes cannot deny superb Siraj\nIf the fourth day of this Test was astonishing for its fluctuations and high emotion, the fifth day provided drama that was barely believable.\nEngland's target of 374 represented their second highest successful chase in Tests and the highest ever on this ground. They began Monday on 339-6, 35 adrift.\nJamie Smith and Jamie Overton were being given a torrid time on Sunday before the weather ended play early. England's task instantly looked easier on Monday when Overton pulled Krishna's first ball of the day for four and followed by inside-edging the next delivery past his stumps to the fine-leg fence.\nThe runs required were down to 27, then the pendulum swung once more.\nSmith looked all at sea. He played and missed at his first two balls from Siraj and edged his third. There was a wait to see if Jurel had pouched the catch, but there was no doubt.\nAtkinson edged the first ball he faced, inches short of KL Rahul at second slip. India's fans, comfortably outnumbering the England support, surrounded the ground with noise.\nSiraj charged in again. Overton played all around his pad. Umpire Kumar Dharmasena took so long to raise his finger, Overton had completed a run. The England man was so sure the review would save him, he began to mark his guard, only for the replay to show umpire's call for shaving the leg stump. India were delirious.\nAtkinson was unsure whether to farm the strike or trust Josh Tongue. The sky got darker and floodlights took hold. Tongue was given leg before to Krishna, but the review showed the ball missing leg stump. England still needed 19.\nEngland had added two more when Tongue was bowled by Krishna. There was confusion as to whether Woakes would bat, then came the sight of the 36-year-old walking down the dressing-room stairs with his left arm covered by his England sweater.\nWoakes ultimately never faced a ball, but his bravery will not be forgotten.\nAtkinson's mighty blow off Siraj was parried over the ropes by Akash Deep and left England with 11 to win. India captain Shubman Gill had the decision over bringing in the field to prevent the single, or to protect the boundary. He chose the latter. Woakes was in obvious pain when he shuffled the bye off the final ball of Siraj's over.\nAtkinson dug out Krishna for two to long-on, at the beginning of the next over. India kept the field back. England took another single. They needed seven when Siraj set off once more.\nAtkinson cleared his front leg again, attempting another heave to the leg side, but Siraj's yorker was pinpoint. He ended with 5-104, his effort every bit as heroic as the lion-hearted Woakes.\nEpic series plays out final act\nAfter the memorable fourth day was curtailed by the weather, there were concerns this series would not get the finale it deserves, played to a conclusion in front of empty seats.\nNot a bit of it. The Oval was sold out in advance and spectators made sure they were not late. They were rewarded with the epic ending, one that had echoes of the 2019 World Cup final, Ben Stokes at Headingley in the same year, or England's one-run defeat by New Zealand in Wellington two years ago.\nIt is a superb win for India, who deserve their 2-2 draw. They played this decisive Test without all of Rishabh Pant, Jasprit Bumrah and Nitish Kumar Reddy. This series may well be looked back on as the birth of a new team under Gill, who was prolific with the bat.\nEngland were without injured captain Stokes, then had to deal with the injury sustained by Woakes on day one. The home side had a patched up pace attack and first-choice spinner Shoaib Bashir is out with a broken finger.\nThe battered bodies reflects the gruelling nature of a gripping series, arguably the best to take place in this country since the iconic 2005 Ashes.\nWhat started with a stunning England run chase at Headingley moved to Gill's masterful batting at Edgbaston. England were taken to a tetchy victory at Lord's by the Herculean efforts of Stokes, then denied by India's gritty resistance at Old Trafford.\nAt various stages, Bashir bowled with a broken finger, Pant batted with a broken foot and Woakes batted with his dislocated shoulder. Neither team took a backward step and there were a number of flashpoint confrontations.\nBy the end, England missed out on a first series win against India since 2018 and their first win against any team in a five-Test series in the same time period.\nMore importantly, they failed in the first part of what they hoped would have been a glorious double, with the Ashes in Australia to come later this year.\nThe first Test in Perth is on 21 November. Woakes is already a huge doubt, and England face a nervous wait over the talismanic Stokes and key pace bowler Mark Wood.\nBefore then, they have white-ball contests at home to South Africa, then away in Ireland and New Zealand. None will match what we have witnessed over the past seven weeks. What a series.\n'An incredible series' - what they said\nEngland captain Ben Stokes speaking to Test Match Special: \"It's been an incredible series - the commitment and energy has been outstanding.\n\"We're bitterly disappointed we couldn't get the series win but myself being a massive advocate of the game of Test cricket, this series has been an unbelievable advert for it across the world. All the doubters saying it's dying a death, this series has said the opposite.\n\"For us, to come out here and try and chase that total down in the way that we did was outstanding. That never say die, never back down attitude we've installed in the group nearly paid off for us. We couldn't quite get over the line.\"\nIndia captain Shubman Gill: \"It means so much. This was a very hard-fought series. Both teams throwing punches and you could never really predict after day four who was going to win the match.\n\"We are a young team but before the start of the series, we spoke about how we didn't want to be looked at as a young team. We wanted to be a gun team and I think we showed that today.\"\nEngland batter Harry Brook: \"It is a great advert for Test cricket. To rock up with a crowd like this today when we needed 30-odd runs to win is phenomenal.\n\"I don't think we could get support like that in any other series, other than the Ashes.\n\"It has been awesome. The most enjoyable series I have played in. We have not left anything out on that pitch. We have been absolutely knackered. A very intense Test series, but a very enjoyable one.\"\nRelated topics\n- Published31 January",
  "scraped_at": "2025-08-04T19:38:54.363985",
  "portal_name": "www.bbc.com"
},
{
  "headline": "South African farm worker says he was forced to feed women to pigs",
  "url": "https://www.bbc.com/news/articles/c4gemjql1r5o",
  "body": "A white South African farm worker accused of killing two black women says he was forced to feed their bodies to pigs, according to lawyers.\nAdrian de Wet is one of three men facing murder charges after Maria Makgato, 45, and Lucia Ndlovu, 34, were killed while allegedly looking for food on a farm near Polokwane in South Africa's northern Limpopo province last year.\nTheir bodies were then alleged to have been given to pigs in an apparent attempt to dispose of the evidence.\nMr De Wet, 20, turned state witness when the trial started on Monday and says farm owner Zachariah Johannes Olivier shot and killed the two women.\nMs Makgato and Ms Ndlovu were searching for soon-to-expire dairy products which had been left for pigs when they were killed.\nMr De Wet, a supervisor on the farm, will testify that he was under duress when he was forced to throw their bodies into the pig enclosure, according to both the prosecution and his lawyer.\nIf the court accepts his testimony, all charges against him will be dropped.\nThe case has sparked outrage across South Africa, exacerbating racial tensions in the country.\nSuch tension is especially rife in rural areas, despite the end of the racist system of apartheid more than 30 years ago. Most private farmland remains in the hands of the white minority, while most farm workers are black and poorly paid, fuelling resentment among the black population, while many white farmers complain of high crime rates.\n- South Africa outrage over farmer accused of feeding women to pigs\n- Is there a genocide of white South Africans as Trump claims?\nWilliam Musora, 50, another farm worker, is the third accused. He and Mr Olivier, 60, are yet to enter a plea and remain behind bars after their bail applications failed.\nThe three men also face charges of attempted murder for shooting at Ms Ndlovu's husband, who was with the women at the farm - as well as possession of an unlicensed firearm and defeating the ends of justice.\nMr Musora, a Zimbabwean national, faces an additional charge under South Africa's Immigration Act over his status as an illegal immigrant.\nThe Limpopo High Court was packed with supporters and relatives of the victims ahead of proceedings.\nMembers of opposition party Economic Freedom Fighters, which has previously called for the farm to be shut down, were also present in the courtroom.\nThe trial was postponed to next week.\nMore BBC stories on South Africa:\nGo to BBCAfrica.com for more news from the African continent.\nFollow us on Twitter @BBCAfrica, on Facebook at BBC Africa or on Instagram at bbcafrica",
  "scraped_at": "2025-08-04T19:38:56.912891",
  "portal_name": "www.bbc.com"
},
{
  "headline": "F1 tycoon pleads guilty to abetting the obstruction of justice",
  "url": "https://www.bbc.com/news/articles/ceqylpw3zzdo",
  "body": "A Singapore-based billionaire hotelier has pleaded guilty to a charge connected to a rare corruption scandal that shocked the country last year.\nOng Beng Seng has admitted to abetting the obstruction of justice by helping ex-transportation minister Subramaniam Iswaran cover up evidence while he was being investigated for corruption.\nOng gave expensive gifts, including an all-expenses paid trip which included a private jet ride, to Iswaran while they were engaged in official business.\nMinisters in Singapore cannot keep gifts unless they pay the market value of the gift to the government, and they must declare anything they receive from people they have business dealings with.\nOng will be sentenced on 15 August.\nHe originally faced up to two years in jail for abetting a public servant in obtaining gifts, while the maximum jail term he faced for the abetment of obstruction of justice is seven years.\nHowever, both prosecutors and Ong's lawyers agreed that given his poor health, a fine should be imposed instead of a jail term, with the prosecution saying \"judicial mercy\" should be exercised.\nOng has a rare bone marrow cancer, and the court previously allowed him to travel abroad for medical and work purposes.\nProsecutors argued that while Ong was pivotal in Iswaran's attempt to cover his tracks, he was much less culpable than Iswaran, who had been a sitting minister.\nOng's lawyers argued that he had \"simply complied\" with the plan thought up by Iswaran.\nAt Iswaran's sentencing last October, the court heard that Iswaran requested Ong bill him for a business class flight from Doha to Singapore, after he discovered that he could have been implicated while police were investigating a separate incident.\nThe judge said that he acted with deliberation and premeditation to avoid a probe.\nOn Monday, the 79-year-old Ong pleaded guilty to belatedly billing Iswaran for the expense.\nA second charge of abetting Iswaran's acceptance of the all-expenses paid trip to Doha, said to be worth around S$20,850 ($16,188; £12,194), was also taken into account.\nIn December 2022, Ong had invited Iswaran on the trip to Qatar, saying he would take care of the trip's expenses, which included hotel accomodation and a flight to Doha on Ong's private jet.\nIswaran accepted the invitation but said he would need to arrive in Singapore on a specific date, with Ong responding that he would arrange for Iswaran to travel from Doha to Singapore on a commercial flight.\nIt was this flight, said to be worth around S$5,700, that Iswaran belatedly made payment to Ong's company for, after he found out that Singapore's corruption bureau was investigating a separate investigation relating to Ong's associates - and had seized the flight manifest which had details of his trip to Doha as part of it.\nHe then asked Ong to have his company, Singapore GP, bill him for the trip.\nThe two men were arrested in July 2023 and charge sheets revealed that Iswaran was gifted more than S$403,000 ($311,882; £234,586) worth of flights, hotel stays, musicals and grand prix tickets.\nAt the time of the offences Iswaran was in the government's F1 steering committee and the chief negotiator on F1-related business matters.\nBorn in Malaysia in 1946 - which was then Malaya - Ong moved to Singapore as a child and founded a hotel and property company in the 1980s.\nOng helped bring the F1 Grand Prix to Singapore and his company Hotel Properties Limited (HPL) has brands like the Four Seasons and Marriott operating under it.\nHotel Properties Limited had earlier in April said that Ong would step down as its managing director to \"manage his medical conditions\".\nSingapore's lawmakers are among the highest-paid in the world, with leaders justifying the handsome salaries by saying it combats corruption.",
  "scraped_at": "2025-08-04T19:38:59.085133",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Hackers, secret cables and security fears: The explosive fight over China's new embassy in the UK",
  "url": "https://www.bbc.com/news/articles/c3v3rygdrryo",
  "body": "The sheet of paper says \"Wanted Person\" at the top. Below is a photo of a young woman, a headshot that might have been taken in a studio. She looks directly at the camera, smiling with her teeth showing, and her dark, shoulder-length hair is neatly brushed.\nAt the bottom, in red, are the words: \"A reward of one million Hong Kong dollars,\" together with a UK phone number.\nTo earn the money, about £95,000, there is a simple instruction: \"Provide information on this wanted person and the related crime or take her to Chinese embassy\".\nThe woman from the photo is standing in front of me. She shudders when she looks at the building.\nWe are outside an imposing structure that was once home to the Royal Mint and which China hopes it can develop into a new mega-embassy in London, replacing the far smaller premises it has occupied since 1877.\nThe new premises, opposite the Tower of London, is already being patrolled by Chinese security guards. The building is ringed with CCTV cameras too.\n\"I've never been this close,\" admits Carmen Lau.\nCarmen, who is 30, fled Hong Kong in 2021 as pro-democracy activists in the territory were being arrested.\nShe argues that the UK should not allow China's \"authoritarian regime\" to have its new embassy in such a symbolic location. One of her fears is that China, with such a huge embassy, could harass political opponents and could even hold them in the building.\nThere are also worries, among some dissidents, that its location - very near London's financial district - could be an espionage risk. Then there is the opposition from residents who say it would pose a security risk to them.\nThe plans had previously been rejected by the local council, but the decision now lies with the government - and senior ministers have signalled they are in favour if minor adjustments are made to the plan.\nThe site is sprawling, at 20,000 square metres, and if it goes ahead it would mark the biggest embassy in Europe. But would it also really bring the dangers that its opponents fear?\nThe biggest embassy in Europe\nChina bought the old Royal Mint Court for £255m in 2018. The area has layer upon layer of history: across the road is the Tower, parts of it were built by William the Conqueror. For centuries kings and queens lived there.\nThe plan itself involves a cultural centre and housing for 200 staff, but in the basement, behind security doors, there are also rooms with no identified use on the plans.\n\"It's easy for me to imagine what would happen if I was taken to the Chinese embassy,\" says Carmen.\nIn 2022, a Hong Kong pro-democracy protester was dragged into the grounds of the Chinese consulate in Manchester and beaten. British police nearby stepped over the boundary to rescue him.\nBack in 2019, mass protests had erupted in Hong Kong, triggered by the government's attempt to bring in a new law allowing for Hong Kong citizens to be extradited to China.\nChina's response included a law that forced all elected officials in Hong Kong, including Carmen who was then a district councillor, to take an oath of loyalty to China. Carmen resigned instead.\nShe claims that journalists for Chinese state-run media started following her. The Ta Kung Pao newspaper, which is controlled by China's central government in Beijing, ran a front page story alleging she and her colleagues had held parties in their council offices.\n\"You know the tactics of the regime,\" she says. \"They were following you, trying to harass you. My friends and my colleagues were being arrested.\"\nCarmen fled to London but believes that she has continued to be targeted.\nHong Kong issued two arrest warrants for her alleging \"incitement to secession and collusion with a foreign country or with external elements to endanger national security\".\nThe bounty letter sent from Hong Kong to half a dozen of her neighbours followed.\n\"The regime just [tries] to eliminate any possible activists overseas,\" she says.\nSteve Tsang, a political scientist and historian who is director of the SOAS China Institute, says he can see why people from Hong Kong, or certain other backgrounds, may be uncomfortable with the new embassy.\nHe argues \"the Chinese government since 1949 does not have a record of kidnapping people and holding them in their embassy compounds.\"\nBut he says some embassy staff would be tasked with monitoring Chinese students and dissidents in the UK and they'd also target UK citizens, such as scientists, business people, and those with influence, to advance China's interests.\nThe Chinese embassy told the BBC it \"is committed to promoting understanding and the friendship between the Chinese and British peoples and the development of mutually beneficial cooperation between the two countries. Building the new embassy would help us better perform such responsibilities\".\nWarnings about espionage\nThere is another fear, held by some opponents, that the Royal Mint Court site could allow China to infiltrate the UK's financial system by tapping into fibre optic cables carrying sensitive data for firms in the City of London.\nThe site once housed Barclays Bank's trading floor, so it was wired directly into the UK's financial infrastructure. Nearby, a tunnel has, since 1985, carried fibre optic cables under the Thames serving hundreds of City firms.\nAnd in the grounds of the Court, is a five-storey brick building - the Wapping Telephone Exchange that serves the City of London.\nAccording to Prof Periklis Petropoulos, an optoelectronics researcher at Southampton University, direct access to a working telephone exchange could allow people to glean information.\nThis has all prompted warnings about potential espionage - including from Conservative frontbencher Kevin Hollinrake, as well as senior Republicans in the US.\nAn official with security experience in former US president Joe Biden's administration told me it's perfectly possible that cables could be tapped with devices that would capture passing information - and that this would be almost impossible to detect.\n\"Anything up to half a mile from the embassy would be vulnerable,\" he says.\nHowever, he argues that China may not be inclined to do this because it has other ways of hacking into systems.\nRegarding these concerns, the Chinese embassy said: \"Anti-China forces are using security risks as an excuse to interfere with the British government's consideration over this planning application.\n\"This is a despicable move that is unpopular and will not succeed.\"\nWhat the neighbours think\nAt the back of the Royal Mint Court is a row of 1980s-built flats. Mark Nygate has lived here for more than 20 years. He gestures across his low garden wall. \"Embassy staff will live there and overlook us,\" he says.\n\"We don't want [the embassy] there because of demonstrations, because of the security risks, because of our privacy.\"\nOpponents of the embassy - Hong Kongers, Tibetans, Uighurs, and opposition politicians - have already staged protests involving up to 6,000 people.\nMostly, though, he fears an attack on the embassy - that could harm him and his neighbours.\nBut Tony Travers, a visiting professor in the LSE Department of Government, lives near the current embassy and isn't convinced that these sorts of protests will materialise for the new neighbours, if the relocation goes ahead.\n\"I'm not aware of any evidence that there are regular protests that block the road outside the current Chinese embassy… self-evidently, there are much larger protests outside a number of other countries' embassies and high commissions.\"\nThe Chinese embassy in London says that the proposed development would \"greatly improve the surrounding environment and bring benefits to the local community and the district\".\nWhen President Xi raised the issue\nChina's first planning application to develop the site was rejected by Tower Hamlets council in 2022 over safety and security concerns - and fears protests and security measures could damage tourism.\nRather than amend the plan or appeal, China waited, then resubmitted an identical application in August 2024, one month after Labour came to power.\nOn 23 August, Sir Keir Starmer phoned Chinese President Xi Jinping for their first talks. Afterwards Sir Keir confirmed that Xi had raised the issue of the embassy.\nSince then, Deputy Prime Minister Angela Rayner has exercised her power to take the matter out of the council's hands, after being urged to do so by Foreign Secretary David Lammy.\nThis is in the context of an attempt by the government to engage with China after previous Conservative Prime Minister Rishi Sunak declared in 2022 that the so-called \"golden era\" of UK-China relations were over.\nFor his part, Prof Travers believes that politics is involved in planning decisions.\n\"The Secretary of State has to make the decision on the basis of the documentation in front of them and the law surrounding and affecting the issue,\" he argues.\n\"But it would be naïve to imagine that politics didn't play a role.\"\n'Kissing up to China'\nLord Peter Ricketts, a former diplomat who chaired the UK's National Security Council, advising prime ministers on global threats, stresses that the country's relationship with China is complex.\nA National Security Strategy published in June laid out the conflicting priorities in the government's approach, highlighting its desire to use the relationship to boost the UK economy but also likely \"continued tension\" over human rights and cyber security.\nBut is that duality of reaping the business benefits while pushing on the human rights transgressions, even possible?\n\"It is absolutely an adversary in some areas, which tries to steal our intellectual property, or suborn our citizens,\" says Lord Ricketts. \"(But) it is a commercial market, a very important one for us, and it's a player in the big global issues like climate and health.\n\"We have to be able to treat China in all those categories at the same time.\"\nThe embassy decision, he says, cuts to the heart of this. \"There are acute dilemmas, and there are choices to be made, whether to privilege the 30, 40 or 50-year relationship with China, which an embassy, I guess, would symbolise.\n\"Or whether to give priority to the short-term security threats, which are no doubt real as well.\"\nThe Conservative MP Sir Iain Duncan Smith is convinced giving the go-ahead for the new embassy would be a big mistake. \"They think that the only way they'll get growth is by kissing up to China and getting them to invest,\" he tells me.\nBut for all the concerns around security, having one big embassy could well make it easier to keep an eye on what Chinese officials are up to in the UK, according to Prof Tsang.\n\"Allowing the Chinese to put their staff on one site is preferable,\" he argues, \"because they're at the moment all over the place in London, you can't actually keep an eye on them.\"\nHe is not convinced that rejecting or approving the embassy will have an effect on business and trade.\n\"The Chinese are the absolute ultimate pragmatists. They are not going to suddenly say that no, we're not selling our best electric vehicles to you any longer just because you denied us the embassy,\" he says.\nBut, equally, \"they are not going to substantially increase Chinese investments in the UK because they have got the new embassy compound.\"\nIf Angela Rayner thinks that too, then her decision may well come down to how seriously she takes the warnings that China could eavesdrop on the UK's banks.\nIf she rejects the embassy it may be because she judges the danger it poses to be very real indeed.\nTop image credits: Reuters, Richard Baker via Getty Images, SOPA Images via Getty Images and EPA -EFE/REX/Shutterstock\nBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. And we showcase thought-provoking content from across BBC Sounds and iPlayer too. You can send us your feedback on the InDepth section by clicking on the button below.",
  "scraped_at": "2025-08-04T19:39:01.227268",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Kremlin plays down Trump's nuclear rhetoric as US envoy set to visit Moscow",
  "url": "https://www.bbc.com/news/articles/cgjy5dzd6ddo",
  "body": "The Kremlin has played down Donald Trump's orders to move two nuclear submarines closer to Russia, saying Moscow did not want to be involved in polemics.\nIn the first official reaction since the US president's comments last Friday, Kremlin spokesman Dmitry Peskov said American submarines were on combat duty anyway and dismissed the idea that there had been an escalation.\n\"Very complex, very sensitive issues are being discussed, which, of course, many perceive very emotionally,\" Peskov said - though he added that everyone should be \"very cautious\" with nuclear rhetoric.\nUS envoy Steve Witkoff is due to visit Russia on Wednesday, according to Russian media.\nLast week President Trump ordered two nuclear submarines to \"be positioned in the appropriate regions\" in response to what he called \"highly provocative\" comments by former Russian President Dmitry Medvedev.\nTrump did not say whether they were nuclear-powered or nuclear-armed submarines.\nMedvedev - who in recent years has espoused increasingly extreme rhetoric online - had accused Trump of \"playing the ultimatum game\" with Russia after the US president set a new deadline for Vladimir Putin to end the war with Ukraine.\nWithout referencing the Medvedev spat directly, Peskov said on Monday that while \"in every country members of the leadership... have different points of view\", Russian foreign policy was dictated by Putin alone.\nMedvedev did not react to Trump's response and has not been active on X since sending the offending post.\nRelations between the US and Russia improved significantly after Trump took office in January - although in recent months the US president has signalled he suspects Putin may not be truly committed to ending the war in Ukraine, which began when Moscow launched its full-scale invasion in February 2022.\nNow Trump has brought forward a deadline for Russia to reach a peace deal, threatening Moscow with severe tariffs targeting its oil and other exports if a ceasefire is not agreed by Friday 8 August.\nStill, Washington and Moscow remain in contact and Peskov welcomed Witkoff's trip later this week.\n\"We are always happy to see Mr Witkoff in Moscow... We consider such contact important, meaningful and useful,\" he said, adding that Witkoff and Putin may meet.\nShould a ceasefire not be reached by Friday, Trump has said he would impose sanctions and secondary tariffs on Moscow to discourage other countries from trading with it.\nBut he has also admitted Russia - now the most sanctioned country in the world - was \"pretty good at avoiding sanctions\".\nThree rounds of talks between Russian and Ukraine since the spring have failed to bring an end to the conflict any closer.\nOnly last week Putin reiterated that Russia's main goal in the war was to \"eradicate the reasons for the crisis in Ukraine and ensure Russia's security\".\nMoscow's maximalist military and political preconditions for peace - including Ukraine becoming a neutral state, dramatically reducing its military and abandoning its Nato aspirations - remain unacceptable to Kyiv and to its Western partners.",
  "scraped_at": "2025-08-04T19:39:03.355385",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Mission begins to save snails threatened by own beauty",
  "url": "https://www.bbc.com/news/articles/clyrv8ndzzjo",
  "body": "Researchers have embarked on a mission to save what some consider to be the world's most beautiful snails, and also unlock their biological secrets.\nEndangered Polymita tree snails, which are disappearing from their native forest habitats in Eastern Cuba, have vibrant, colourful and extravagantly patterned shells.\nUnfortunately, those shells are desirable for collectors, and conservation experts say the shell trade is pushing the snails towards extinction.\nBiologists in Cuba, and specialists at the University of Nottingham in the UK, have now teamed up with the goal of saving the six known species of Polymita.\nThe most endangered of those is Polymita sulphurosa, which is lime green with blue flame patterns around its coils and bright orange and yellow bands across its shell.\nBut all the Polymita species are strikingly bright and colourful, which is an evolutionary mystery in itself.\n\"One of the reasons I'm interested in these snails is because they're so beautiful,\" explained evolutionary geneticist and mollusc expert Prof Angus Davison from the University of Nottingham.\nThe irony, he said, is that this is the reason the snails are so threatened.\n\"Their beauty attracts people who collect and trade shells. So the very thing that makes them different and interesting to me as a scientist is, unfortunately, what's endangering them as well.\"\nSearching online with Prof Davison, we found several platforms where sellers, based in the UK, were offering Polymita shells for sale. On one site a collection of seven shells was being advertised for £160.\n\"For some of these species, we know they're really quite endangered. So it wouldn't take much [if] someone collects them in Cuba and trades them, to cause some species to go extinct.\"\nShells are bought and sold as decorative objects, but every empty shell was once a living animal.\nWhile there are international rules to protect Polymita snails, they are difficult to enforce. It is illegal - under the Convention on International Trade in Endangered Species - to take the snails or their shells out of Cuba without a permit. But it is legal to sell the shells elsewhere.\nProf Davison says that, with pressures like climate change and forest loss affecting their natural habitat in Cuba, \"you can easily imagine where people collecting shells would tip a population over into local extinction\".\nTo try to prevent this, Prof Davison is working closely with Prof Bernardo Reyes-Tur at the Universidad de Oriente, Santiago de Cuba, who is a conservation biologist.\nThe aim of this international project is to better understand how the snails evolved and to provide information that will help conservation.\nProf Reyes-Tur's part of the endeavour is perhaps the most challenging: Working with unreliable power supplies and in a hot climate, he has brought Polymita snails into his own home for captive breeding.\n\"They have not bred yet, but they're doing well,\" he told us on a video call.\n\"It's challenging though - we have blackouts all the time.\"\nMeanwhile, at the well-equipped labs at the University of Nottingham, genetic research is being carried out.\nHere, Prof Davison and his team can keep tiny samples of snail tissue in cryogenic freezers to preserve them. They are able to use that material to read the animals' genome - the biological set of coded instructions that makes each snail what it is.\nThe team aims to use this information to confirm how many species there are, how they are related to each other and what part of their genetic code gives them their extraordinary, unique colour patterns.\nThe hope is that they can reveal those biological secrets before these colourful creatures are bought and sold into extinction.\n\"Eastern Cuba is the the only place in the world where these snails are found,\" Prof Davison told BBC News.\n\"That's where the expertise is - where the people who know these snails, love them and understand them, live and work.\n\"We hope we can use the genetic information that we can bring to contribute to their conservation.\"",
  "scraped_at": "2025-08-04T19:39:05.511296",
  "portal_name": "www.bbc.com"
},
{
  "headline": "India win all-time classic despite Woakes heroics",
  "url": "https://www.bbc.com/sport/cricket/articles/cx279ylegeyo",
  "body": "- Published\nFifth Rothesay Test, The Kia Oval (day five of five)\nIndia 224 (Nair 57, Atkinson 5-33, Tongue 3-57) & 396 (Jaiswal 118; Tongue 5-125)\nEngland 247 (Crawley 64; Krishna 4-62, Siraj 4-86) & 367 (Brook 111, Root 105; Siraj 5-104)\nIndia won by six runs; draw series 2-2\nEngland were denied a record-breaking run chase by an irresistible India, who snatched victory by six runs in one of the most dramatic conclusions in Test cricket history.\nIn scenes that will go down in British sporting folklore, Chris Woakes came out to bat with his arm in a sling to support Gus Atkinson when England needed 17 to reach their target of 374.\nWoakes was given a hero's welcome, then stood at the non-striker's end as Atkinson attempted to swipe England to victory.\nAmid almost unbearable tension at The Oval, Atkinson and Woakes somehow tried to inch England on, surrounded by the deafening din of the febrile Indian support.\nAfter Atkinson clobbered Mohammed Siraj for six, Woakes ran a bye to wicketkeeper Dhruv Jurel, who missed the stumps, in order for Atkinson to pinch the strike.\nIndia kept the field back. Prasidh Krishna bowled the next over. Woakes was able to run a two, then another vital single off the final ball to leave Atkinson with the strike.\nBut Atkinson was bowled by the brilliant Siraj, giving India their narrowest victory in terms of runs in a Test.\nIt left one of the greatest series ever played level at 2-2, concluding 25 days of outstanding sporting theatre.\nAt the end of a fractious series, India broke off from the delirious celebrations to commiserate with Woakes, then embarked on a lap of honour, soaking up a historic win with their jubilant fans.\n- Published31 minutes ago\nLion-hearted Woakes cannot deny superb Siraj\nIf the fourth day of this Test was astonishing for its fluctuations and high emotion, the fifth day provided drama that was barely believable.\nEngland's target of 374 represented their second highest successful chase in Tests and the highest ever on this ground. They began Monday on 339-6, 35 adrift.\nJamie Smith and Jamie Overton were being given a torrid time on Sunday before the weather ended play early. England's task instantly looked easier on Monday when Overton pulled Krishna's first ball of the day for four and followed by inside-edging the next delivery past his stumps to the fine-leg fence.\nThe runs required were down to 27, then the pendulum swung once more.\nSmith looked all at sea. He played and missed at his first two balls from Siraj and edged his third. There was a wait to see if Jurel had pouched the catch, but there was no doubt.\nAtkinson edged the first ball he faced, inches short of KL Rahul at second slip. India's fans, comfortably outnumbering the England support, surrounded the ground with noise.\nSiraj charged in again. Overton played all around his pad. Umpire Kumar Dharmasena took so long to raise his finger, Overton had completed a run. The England man was so sure the review would save him, he began to mark his guard, only for the replay to show umpire's call for shaving the leg stump. India were delirious.\nAtkinson was unsure whether to farm the strike or trust Josh Tongue. The sky got darker and floodlights took hold. Tongue was given leg before to Krishna, but the review showed the ball missing leg stump. England still needed 19.\nEngland had added two more when Tongue was bowled by Krishna. There was confusion as to whether Woakes would bat, then came the sight of the 36-year-old walking down the dressing-room stairs with his left arm covered by his England sweater.\nWoakes ultimately never faced a ball, but his bravery will not be forgotten.\nAtkinson's mighty blow off Siraj was parried over the ropes by Akash Deep and left England with 11 to win. India captain Shubman Gill had the decision over bringing in the field to prevent the single, or to protect the boundary. He chose the latter. Woakes was in obvious pain when he shuffled the bye off the final ball of Siraj's over.\nAtkinson dug out Krishna for two to long-on, at the beginning of the next over. India kept the field back. England took another single. They needed seven when Siraj set off once more.\nAtkinson cleared his front leg again, attempting another heave to the leg side, but Siraj's yorker was pinpoint. He ended with 5-104, his effort every bit as heroic as the lion-hearted Woakes.\nEpic series plays out final act\nAfter the memorable fourth day was curtailed by the weather, there were concerns this series would not get the finale it deserves, played to a conclusion in front of empty seats.\nNot a bit of it. The Oval was sold out in advance and spectators made sure they were not late. They were rewarded with the epic ending, one that had echoes of the 2019 World Cup final, Ben Stokes at Headingley in the same year, or England's one-run defeat by New Zealand in Wellington two years ago.\nIt is a superb win for India, who deserve their 2-2 draw. They played this decisive Test without all of Rishabh Pant, Jasprit Bumrah and Nitish Kumar Reddy. This series may well be looked back on as the birth of a new team under Gill, who was prolific with the bat.\nEngland were without injured captain Stokes, then had to deal with the injury sustained by Woakes on day one. The home side had a patched up pace attack and first-choice spinner Shoaib Bashir is out with a broken finger.\nThe battered bodies reflects the gruelling nature of a gripping series, arguably the best to take place in this country since the iconic 2005 Ashes.\nWhat started with a stunning England run chase at Headingley moved to Gill's masterful batting at Edgbaston. England were taken to a tetchy victory at Lord's by the Herculean efforts of Stokes, then denied by India's gritty resistance at Old Trafford.\nAt various stages, Bashir bowled with a broken finger, Pant batted with a broken foot and Woakes batted with his dislocated shoulder. Neither team took a backward step and there were a number of flashpoint confrontations.\nBy the end, England missed out on a first series win against India since 2018 and their first win against any team in a five-Test series in the same time period.\nMore importantly, they failed in the first part of what they hoped would have been a glorious double, with the Ashes in Australia to come later this year.\nThe first Test in Perth is on 21 November. Woakes is already a huge doubt, and England face a nervous wait over the talismanic Stokes and key pace bowler Mark Wood.\nBefore then, they have white-ball contests at home to South Africa, then away in Ireland and New Zealand. None will match what we have witnessed over the past seven weeks. What a series.\n'An incredible series' - what they said\nEngland captain Ben Stokes speaking to Test Match Special: \"It's been an incredible series - the commitment and energy has been outstanding.\n\"We're bitterly disappointed we couldn't get the series win but myself being a massive advocate of the game of Test cricket, this series has been an unbelievable advert for it across the world. All the doubters saying it's dying a death, this series has said the opposite.\n\"For us, to come out here and try and chase that total down in the way that we did was outstanding. That never say die, never back down attitude we've installed in the group nearly paid off for us. We couldn't quite get over the line.\"\nIndia captain Shubman Gill: \"It means so much. This was a very hard-fought series. Both teams throwing punches and you could never really predict after day four who was going to win the match.\n\"We are a young team but before the start of the series, we spoke about how we didn't want to be looked at as a young team. We wanted to be a gun team and I think we showed that today.\"\nEngland batter Harry Brook: \"It is a great advert for Test cricket. To rock up with a crowd like this today when we needed 30-odd runs to win is phenomenal.\n\"I don't think we could get support like that in any other series, other than the Ashes.\n\"It has been awesome. The most enjoyable series I have played in. We have not left anything out on that pitch. We have been absolutely knackered. A very intense Test series, but a very enjoyable one.\"\nRelated topics\n- Published31 January",
  "scraped_at": "2025-08-04T19:39:07.646546",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Influential Indian tribal leader Shibu Soren dies at 81",
  "url": "https://www.bbc.com/news/articles/cvg3130l8kno",
  "body": "Shibu Soren, a prominent Indian tribal leader and a three-time chief minister of the eastern state of Jharkhand, has died at the age of 81.\nHe was undergoing treatment in Delhi for a kidney ailment and had been on life support after he suffered a stroke last month.\nIn a political career of more than 40 years, Soren co-founded the Jharkhand Mukti Morcha (JMM), an influential regional party that has been at the forefront of the creation of the tribal-dominated eastern state.\nHe became the chief minister of Jharkhand three times, but failed to complete his any of these terms in office due to political instability in the state.\nHis son Hemant Soren, who is the current chief minister of Jharkhand, announced the leader's death on Monday.\n\"Our respected Dishom Guru has left us, I have nothing left,\" he wrote on X, referring to Soren by his moniker, which means \"great leader\" in Santhali, the language spoken by the Santhal tribe – one of India's largest tribal communities.\nPrime Minister Narendra Modi led the tributes, calling Soren \"a grassroot leader who rose through the ranks of public life with unwavering dedication to the people\".\nBorn in 1944, Soren grew up in a small village in present-day Jharkhand at a time when the state was still a part of Bihar.\nHe founded the JMM in 1973 with the main objective to carve out a separate state for tribespeople from Bihar's southern districts.\nAfter Jharkhand was granted statehood in 2000, Soren became an influential figure in the region's politics.\nIn 2004, he became the federal coal minister in the Congress party's cabinet but quit a few months later, after he was convicted in a murder case.\nHe returned to the cabinet after getting bail later that year. In 2005, he resigned from the position to become the chief minister of Jharkhand, but had to step down within 10 days after his party failed to prove its majority in the state assembly.\nSoren was re-inducted into the federal government as the coal minister later that year. But he had to resign again, after he was convicted in another murder case, this time in connection with the kidnapping and murder of his personal secretary Shashinath Jha in 1994. He was eventually cleared of those charges in 2018.\nOn Monday, as the news of his death broke, leaders across political parties paid tributes to the leader.\nSenior Congress leader Jairam Ramesh called him \"the pivotal figure\" who led the movement for the creation of Jharkhand. \"He was truly a legend whose passion for social and economic justice was inspirational,\" Ramesh wrote on X.\n\"For the people of Jharkhand, he was no less than a god,\" said Sanjay Raut, a member of the influential Shiv Sena (UBT) party of Maharashtra state.\nFormer Bihar chief minister Lalu Prasad Yadav, who had opposed the creation of Jharkhand state but later allied with Soren, said his death was a matter of \"deep sorrow\" and called him a great leader who fought for the rights of tribespeople and Dalits (formerly untouchables).",
  "scraped_at": "2025-08-04T19:39:10.646048",
  "portal_name": "www.bbc.com"
},
{
  "headline": "New Zealand woman arrested after two-year-old found in luggage",
  "url": "https://www.bbc.com/news/articles/cj3ln1velv0o",
  "body": "A woman in New Zealand has been arrested after a two-year-old girl was found in her luggage while she was travelling on a bus.\nPolice said officers were called to a bus stop in Kaiwaka, a small town in the north of the country, on Sunday after a passenger asked for access to the luggage compartment.\n\"The driver became concerned when he noticed the bag moving. When the driver opened the suitcase, they discovered the two-year-old girl,\" New Zealand Police said a statement.\nThe woman, 27, has been arrested and charged with ill-treatment/neglect of a child.\n\"The little girl was reported to be very hot, but otherwise appeared physically unharmed,\" police said.\nShe has been taken to hospital, where she is undergoing a medical assessment, they added.\nThe relationship between the woman and the child has not been disclosed.\nThe woman is due to appear in the North Shore District Court on Monday.\n\"We would like to acknowledge and commend the bus driver, who noticed something wasn't right and took immediate action, preventing what could have been a far worse outcome,\" police said.",
  "scraped_at": "2025-08-04T19:39:12.810766",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Secret filming exposes the 'madams' involved in Kenya's child-sex trade",
  "url": "https://www.bbc.com/news/articles/c15l9zl508eo",
  "body": "A BBC Africa Eye investigation has revealed how women, known as \"madams\", have involved children as young as 13 in prostitution in Kenya.\nIn the transit town of Maai Mahiu, in Kenya's Rift Valley, trucks and lorries pound the streets day and night transporting goods and people across the country into Uganda, Rwanda, South Sudan and the Democratic Republic of Congo.\nThe key transport hub, just 50km (31 miles) east of the capital, Nairobi, is known for prostitution, but children are also being sexually abused there.\nTwo undercover investigators, posing as sex workers wanting to learn how to become madams, spent months earlier this year infiltrating the sex trade in the town.\nTheir secret filming reveals two different women who say they know it is illegal and then introduce the investigators to underage girls in the sex industry.\nThe BBC gave all its evidence to the Kenyan police in March. The BBC believes the madams have moved location since then. The police said the women and young girls we filmed could not be traced. To date there have been no arrests.\nConvictions are rare in Kenya. For successful prosecutions, police need testimonies from children. Often vulnerable minors are too afraid to testify.\nThe BBC's grainy footage filmed on the street in the dark showed one woman, who calls herself Nyambura, laughing as she says: \"They're still children, so it's easy to manipulate them by just handing them sweets.\"\n\"Prostitution is a cash crop in Maai Mahiu; the truckers basically fuel it. And that's how we benefit. It's been normalised in Maai Mahiu,\" she explained, adding that she had one girl as young as 13, who had already been \"working\" for six months.\n\"It becomes very risky when you're dealing with minors. You can't just bring them out openly in town. I only sneak them out at night in great secrecy,\" Nyambura said.\nThe act of prostitution by a consenting adult is not explicitly criminalised under Kenyan national law but it is banned by many municipal by-laws. It is not banned in Maai Mahiu, which is part of Nakuru county.\nUnder the penal code it is illegal to live from the earnings of prostitution, either as a sex worker or third party facilitating or profiting from prostitution.\nThe trafficking or sale of minors under the age of 18 carries a prison sentence ranging from 10 years to life.\nWhen asked whether the clients wear condoms, Nyambura said she usually made sure they had protection but the odd one did not.\n\"Some children want to earn more [so don't use them]. Some are forced [not to use them],\" she said.\nIn another meeting, she led the undercover investigator to a house where three young girls sat huddled on a sofa, another on a hard-backed chair.\nNyambura then left the room, giving the investigator an opportunity to speak to the girls alone.\nThey described being repeatedly abused for sex, on a daily basis.\n\"Sometimes you have sex with multiple people. The clients force you to do unimaginable things,\" said one of the girls.\nThere are no recent statistics on the number of children forced to work in Kenya's sex industry. In 2012, the US State Department Country Report on Human Rights Practices in Kenya cited an estimate of 30,000, a figure derived from the Kenyan government and now defunct non-governmental organisation (NGO), Eradicate Child Prostitution in Kenya.\nOther studies have focused on specific areas, especially along the country's coast - known for its tourist resorts. A 2022 report for the NGO Global Fund to End Modern Slavery found almost 2,500 children were forced into sex work in Kilifi and Kwale counties.\nA second undercover investigator gained the trust of a woman who called herself Cheptoo and had multiple meetings with her.\nShe said selling young girls meant she could \"earn a living and be comfortable\".\n\"You carry out this kind of business in great secrecy because it is illegal,\" she said.\n\"If anyone says they want a young girl, I ask them to pay me. We also have our regulars who always come back for them.\"\nCheptoo took the undercover investigator to a club to meet four of her girls. The youngest said she was 13 years old. The others said they were 15.\nShe opened up about the profit she makes from them, saying for every 3,000 Kenyan shillings ($23; £17) the girls deliver, her share was 2,500 shillings ($19; £14).\nAt another meeting, in a house in Maai Mahiu, Cheptoo left the undercover investigator alone with two underage girls.\nOne of them told her she had, on average, sex with five men a day.\nWhen asked what happened if she refused to have sex without a condom, she said she had no choice.\n\"I have to [have sex without a condom]. I will be chased away, and I have nowhere to run to. I am an orphan.\"\nKenya's sex industry is a complex, murky world where both men and women are involved in facilitating child prostitution.\nIt is not known how many children are forced into sex work in Maai Mahiu, but in this small town of around 50,000 people it is easy to find them.\nPeople outside the UK can watch here\nA former sex worker, known as \"Baby Girl\", now provides refuge in Maai Mahiu for girls who have escaped sexual abuse.\nThe 61-year-old worked in the sex industry for 40 years - first finding herself on the streets in her early twenties. She was pregnant and had her three young children with her after fleeing her husband because of domestic violence.\nAt her wooden kitchen table in a bright parlour at the front of her house, she introduced the BBC to four young women who were all forced into sex work by madams in Maai Mahiu when they were children.\nEach girl shared similar stories of broken families or abuse at home - they came to Maai Mahiu to escape, only to be violently abused again.\nMichelle described how, at 12 years old, she lost her parents to HIV and was evicted on to the streets where she met a man who gave her somewhere to live and began sexually abusing her.\n\"I literally had to pay him in kind for educating me. I reached my limit, but I had no-one,\" she said.\nTwo years later, she was approached by a woman who turned out to be a madam in Maai Mahiu and forced her into sex work.\nLilian, who is now 19, also lost her parents at a very young age. She was left with an uncle who filmed her in the shower and sold the images to his friends. The voyeurism soon turned into rape.\n\"That was my worst day. I was 12 then.\"\nWhen she escaped, she was raped again by a truck driver who took her to Maai Mahiu. It was here, like Michelle, where she was approached by a woman who forced her into sex work.\nThese young women's short lives have been fuelled by violence, neglect and abuse.\nNow, housed by Baby Girl, they are learning new skills - two in a photography studio and two in a beauty salon.\nThey also assist Baby Girl with her outreach work in the community.\nNakuru county has one of the highest rates of HIV infection in Kenya, and Baby Girl, supported by US aid agency USAID, is on a mission to educate people about the risks of unprotected sex.\nShe has an office at Karagita Community Health Centre, near Lake Naivasha, where she works providing condoms and advice.\nHowever, with US President Donald Trump's decision to pull USAID funding, her outreach programmes are about to stop.\n\"From September we will be unemployed,\" she told the BBC World Service, adding how worried she was about the young women and girls who depend on her.\n\"You see how vulnerable these children are. How would they survive on their own? They are still healing.\"\nThe US government did not respond to comments in this investigation about the likely impact of its funding cuts. USAID officially closed last month.\nFor now, Lilian is focused on learning photography and recovering from abuse.\n\"I am not afraid any more, because Baby Girl is there for me,\" she said. \"She is helping us bury the past.\"\nMore from BBC Africa Eye:\n- Caught in the crossfire - the victims of Cape Town's gang warfare\n- 'They aimed to kill' - BBC identifies security forces who shot Kenya anti-tax protesters\n- Sudan's years of war - BBC smuggles in phones to reveal hunger and fear\n- 'Terrible things happened' - inside TB Joshua’s church of horrors\n- How a Malawi WhatsApp group helped save women trafficked to Oman\nGo to BBCAfrica.com for more news from the African continent.\nFollow us on Twitter @BBCAfrica, on Facebook at BBC Africa or on Instagram at bbcafrica",
  "scraped_at": "2025-08-04T19:39:14.987524",
  "portal_name": "www.bbc.com"
},
{
  "headline": "BBC finds electrocuted, drowned and starved cats in online torture groups",
  "url": "https://www.bbc.com/news/articles/c5yp9w5kyw7o",
  "body": "An international network that shares online videos of cats and kittens being tortured has members in the UK, the BBC has found.\nThe network is thought to have thousands of members who post, share and sell graphic images and videos of cats being hurt and killed.\nIn one group, on an encrypted messaging app, the BBC found evidence of British members suggesting users adopt kittens from the RSPCA to mutilate.\nThe BBC investigation comes after two teenagers admitted torturing and killing two kittens in a park in Ruislip, north-west London, in May. They are due to be sentenced on Monday.\nThe following report contains graphic content and descriptions of animal cruelty.\nThe 16-year-old girl, and boy, aged 17, who cannot be named for legal reasons, pleaded guilty after the kittens were found cut open and strung up. Knives, blowtorches and scissors were also found at the scene.\nIt is understood that police are now looking into possible links to a wider network of cat torturers who film, post and sell footage of attacks on encrypted messaging apps.\nThese groups started in China, but BBC News has identified members now active across the world, including in the UK.\nThe scale of the network has been documented by animal rights activists Feline Guardians.\nThe group says between May 2023 and May 2024, a new video showing the torture and execution of a kitten or cat was uploaded approximately every 14 hours.\nIt says it has documented 24 groups active this year, the largest of which had more than 1,000 members. The most active torturer is believed to have filmed the torture and killing of more than 200 cats.\nChat conversations in one group, seen by the BBC, include what appear to be UK-based accounts discussing how to get hold of cats to abuse.\nOne member discussed how to adopt kittens from the RSPCA and posted application forms. Another post shared an advert for kittens for sale in the UK, posting that they wanted to \"torture them so bad\".\nLara is a volunteer with Feline Guardians. We have agreed not to use her full name for fear of reprisals.\nShe said: \"Every day I feel heartbroken, there is not a day that goes past that I don't feel like my heart is breaking.\"\nShe has spent time undercover in the forums and says there is no limit to the pain the torturers are prepared to inflict.\nShe describes it as the \"depths of evil\".\nVideos and photographs seen by the BBC are graphic and extremely disturbing.\nThey include footage of cats being drowned and electrocuted. One video speculates on how long a kitten in a cage will survive if it is not given food.\nGroup members appear to want to inflict as much pain as possible. In online chats, torturers explain how they use electrocution to resuscitate a cat in order to prolong suffering.\nNew members are encouraged to mutilate and post videos to gain access to a wider network.\nThe BBC saw evidence that suggested children were taking part in these groups. One member posted: \"I'm 10 years old and I like to torture cats.\"\nIn September 2023, the network even promoted a \"100 cat kill\" competition, during which members were encouraged to see how quickly the group could torture and kill 100 cats.\nVideos depicting the horrific torture of cats first went viral in China in 2023.\nThe man responsible for two extremely graphic videos, Wang Chaoyi, was detained for 15 days by the Chinese authorities and forced to issue a \"letter of repentance\".\nBut his footage developed a cult following and others began making similar content for Chinese and Western social media, gaining thousands of views, before groups developed on encrypted messaging apps.\nOne website even describes itself as a place for the \"cat-lover community\" and requests viewers \"submit your work\".\nUsers can only gain access if they provide evidence of their own cat torture.\nWho is Little Winnie?\n\"Little Winnie\" is a well known name used in the cat torture community for having a profile picture that mocks the Chinese leader Xi Jinping with an image of Winnie the Pooh.\nAccounts with that name and profile picture are described as administrators in a number of forums.\nAn activist from Feline Guardians got in touch with one of those Little Winnie accounts and lured the man behind it into an online relationship.\n\"I felt disgusted having to be friendly and then having to have this friendship with him,\" the activist, who does not want to be named, said.\nShe communicated for several weeks and infiltrated the network.\n\"It was just an endless scroll of torture videos, one after the other,\" she said. \"I felt, 'I just can't watch this'. Even though I'm messaging him, I can't watch this. I had to sort of turn off my brain.\"\nEventually she persuaded the man behind the account to do a video call. From that call, the group identified a 27-year-old man living in the Japanese capital Tokyo.\nWhen contacted by the BBC, the man said he categorically denied any involvement in these activities.\nLara, from Feline Guardians, told us that law enforcement and governments need to tackle the groups, saying \"it will only continue to expand and get worse\".\nFeline Guardians has held demonstrations outside the Chinese Embassy, in London, demanding that authorities in Beijing do more.\n\"In mainland China, there are no laws that are stopping this. So that means that abusers and torturers can effectively do what they want and live out these very sadistic fantasies without any consequence. These videos are then uploaded, and essentially that's a global problem, because that means that everyone has access to these videos. Children are seeing this,\" Lara said.\nIan Briggs, head of the RSPCA's special operations unit, told the BBC: \"Treating animals in this way is absolutely not acceptable and has no place in a modern society that is largely made up of kind, compassionate animal lovers.\"\nJohanna Baxter MP, chair of the All Party Parliamentary Group on Cats, said these groups were \"a deeply worrying trend, particularly among young men\".\n\"Animal abuse often acts as a gateway, making future acts of violence easier to rationalise and commit,\" she added.",
  "scraped_at": "2025-08-04T19:39:17.127626",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Tesla awards boss Elon Musk $29bn in shares",
  "url": "https://www.bbc.com/news/articles/cz71vn1v3n4o",
  "body": "Tesla has granted its chief executive Elon Musk $29bn (£21.7bn) worth of its shares, in an attempt to keep the billionaire at the firm.\nThe move comes after a US court struck down his 2018 pay package, worth more than $50bn, ruling that it was \"unfair to shareholders\".\nMusk has been appealing the decision made by the Delaware court in 2024 and on Monday Tesla told shareholders it was \"confident\" that the $29bn of shares \"will incentivize Elon to remain at Tesla\" especially as \"the war for AI talent is intensifying\".\nThe award should boost Musk's voting power on the electric car company's board.\n\"It is imperative to retain and motivate our extraordinary talent, beginning with Elon\", Tesla's board wrote on X, a platform owned by Musk, adding that \"no one matches Elon's remarkable combination of leadership experience, technical expertise\".\nThe company said the billionaire had a \"proven track record\" in building \"revolutionary and profitable businesses\".\nTesla said if the Delware court reinstated Musk's 2018 pay deal, he would forfeit or return the latest share aware to avoid a \"double dip\".\nThe carmaker's board said it hoped its chief executive could be awarded the deal worth $56bn, which would be the biggest pay deal in corporate American history.\nThe deal was structured in such a way that if Mr Musk did not hit certain milestones – such as Tesla's market value, sales and underlying profit – he would not get paid at all.\nBut he achieved the targets that were laid out.\nMusk's appeal to get his pay packet reinstated argues that the lower court made legal errors when rescinding his pay package. He has previously said that it should be company shareholders who decide pay.\nMusk's latest pay deal comes as tech firms trying to assert themselves in the AI sector have been offering huge sums to workers at rivals in an effort to persuade them to join them and boost their development.\nFacebook founder Mark Zuckerberg was said to have recently tried to lure top developers from ChatGPT-creator OpenAI with million-dollar pay deals.\nMeanwhile Microsoft's AI division, headed up by former Google DeepMind co-founder Mustafa Suleyman, recently gained several new hires from Google's ranks.\nTesla the company was at an \"inflection point\" and needed Musk's prowess as it pivots from being an electric vehicle firm to an AI and robotics focussed company.\nThe company added that the share award would be attractive for Musk \"with other \"demands on his time and attention\".\nMusk's other roles include executive positions at xAI, Neuralink, and The Boring Company, which makes tunnels and other infrastructure in the US.\nHe recently announced that he was stepping back from politics, after a stint as US President Donald Trump's advisor.\nAdditional reporting by Liv McMahon.",
  "scraped_at": "2025-08-04T19:39:19.261527",
  "portal_name": "www.bbc.com"
},
{
  "headline": "The big fat 'fake' Indian wedding - Gen Z's latest party trend",
  "url": "https://www.bbc.com/news/articles/cdxyrk04kd0o",
  "body": "What comes to mind when you think of a big fat Indian wedding?\nDazzling lights, glittering outfits, Bollywood hits, a lavish spread of food and an atmosphere soaked in celebration. Everything feels extravagant, emotional and larger than life.\nNow imagine all of that without the bride and groom. No pheras (a Hindu marriage ritual where the couple takes seven rounds around a sacred fire), no relatives, no tearful farewells. Just the party.\nWelcome to the world of fake weddings - a rising trend in Indian cities where people gather to enjoy the wedding party, minus the actual marriage.\nThese ticketed events, organised by hotels, clubs and companies, are designed purely for fun and promise to offer the full experience of a wedding party without any stress, rituals or responsibilities. Simply put, it's a wedding-themed party night.\nOver the past few weeks, fake weddings have been making a splash in big cities such as Delhi, Mumbai and Bengaluru. The attendees are usually young people looking to enjoy a night out with friends, indulging in the drama and fun of a traditional Indian wedding without the attendant pressures.\nLast week, we attended one such curated event in Delhi - a fake sangeet (a sangeet is a night of music and dance usually held a few days before the wedding).\nAt the event, held at a plush club, the vibe was electric: women twirled in sequinned saris and lehengas (long skirts and blouses), men showed up in tailored kurtas and ethnic jackets. A traditional dhol drummer led the crowd to the dance floor and tequila-filled gol gappas (a popular Indian street snack) made the rounds.\nShivangi Sareen, who attended an event like this for the first time, found it \"amazing\".\n\"At family weddings, there's so much pressure - the rules around dressing up, the judgement [from relatives]. But here, it's just fun,\" she said. \"Especially because we got to do it all with our friends. We decided our outfits the day before and got ready together.\"\nTicket prices typically start at around 1,500 rupees ($17; £13) and can go up to 15,000 rupees or more, depending on the venue and facilities. Shivangi and her friends paid 10,000 rupees per couple to attend.\n\"I wouldn't mind spending this once a month. The whole experience was totally worth it.\"\nSharad Madan, owner of a restaurant which hosted the event, says the trend underscores that novelty is key in the hospitality sector.\n\"We have to keep doing something new for our patrons,\" he said.\nIt cost them around a million rupees to plan and organise the event, Mr Madan says, and the team expected to make double that through ticket sales. But it's not just about profits, he says.\n\"It's about engagement. Even if it doesn't give me the same kind of returns, I would still do it because our patrons want something different.\"\nKaushal Chanani, co-founder of 8Club events which hosted a fake wedding party attended by 2,000 people in Bengaluru last month, says that the inspiration for fake weddings came from young Indians living abroad.\n\"People from the diaspora would gather and dance to Bollywood music, dress in ethnic [traditional] clothes and enjoy the evening,\" he said. \"This is the idea we followed as well.\"\nThe response to the Bengaluru event, held at a five-star hotel, was \"overwhelming\", he says. It encouraged them to plan a similar event in Delhi - which was sold out - and they started getting queries from event organisers in other cities such as Jaipur, Kolkata and Lucknow.\n\"We now give out our standard operating procedure (SOP) to people who are interested,\" he says. \"It is a guide on how to create the experience, market it and make it profitable.\"\nHowever, not all fake weddings follow the same script.\nThird Place, an experience-based start-up, recently hosted a sober sangeet in Bengaluru - no alcohol, just a themed celebration.\n\"We divided attendees into groom and bride's teams and organised games like charades and guessing who the relative is from a stereotype,\" said CEO Anurag Pandey.\nThere were dhol drums, a grand welcome for all guests and even astrology-themed games. Alcohol was deliberately left out.\n\"Sometimes booze takes away from the experience,\" Mr Pandey said. \"We wanted to do more than just a pub night or a regular takeover. We wanted to showcase the spirit of Indian weddings.\"\nCommentators say the popularity of these events reflects young people's growing desire to find reasons to celebrate.\n\"People need a hook of some kind… an occasion to celebrate. And there's no better setting than a wedding, which brings together all the elements of fun,\" says writer and social commentator Santosh Desai.\n\"It's the pinnacle of enjoyment - especially when it's free from the stress that accompanies real weddings.\"\nHe also points out that these events give people a reason to re-wear expensive wedding outfits bought in the past.\nSo, are such events here to stay?\nEvent planner Vijay Arora, founder of Delhi-based Touchwood Events, believes fake weddings are currently a fad - but one with potential.\n\"Gen Z definitely wants to be part of such celebrations,\" he said.\n\"If it emerges as a new market category then it can be a major game changer since the scale will increase - which eventually amps up business opportunities for the entire industry.\"\nIndia's wedding industry is estimated to be worth around $130bn, according to investment advisory firm Wright Research.\nWhile the sector is booming, there are constraints. Most weddings take place during the cooler months - typically between November and March - and often at auspicious times, while the monsoon season (June to August) is considered off-season.\nWith venues free, vendors available and people constantly chasing experiences, fake weddings could step in to fill the gap if the trend holds.\nMr Arora says he was surprised by the rise of fake weddings.\n\"But it also helps in understanding that such events are something that we want to celebrate or be a part of. Even if we can't attend the real events our friends or family host, we still want to experience them by joining these fake ones.\"\nHowever, not every guest walks away thrilled.\nSrishti Sharma, a 23-year-old Bengaluru-based marketing professional, said she was underwhelmed by the only fake wedding she attended.\n\"I've lived away from home for a few years now and I really missed attending a wedding,\" she said.\n\"The biggest plus was not having nagging relatives telling you 'you're next in line to get married'.\"\nMs Sharma and her friends spent hours picking outfits, but the event fell short.\n\"They began with EDM and switched to Bollywood only after two hours,\" she said.\n\"We expected wedding food but got pizza and fries - no dessert, just alcohol. The decor was basic and felt lazy.\"\nSome have criticised the events, saying they could come across as trivialising traditional Indian events and values.\nBut Vidhi Kapoor, who attended the fake sangeet in Delhi, disagrees.\n\"It might have been offensive had people been asked to dress up like a bride or groom but here it's just a party, we should take it in high spirits,\" she said.\nFollow BBC News India on Instagram, YouTube, Twitter and Facebook.",
  "scraped_at": "2025-08-04T19:39:21.444782",
  "portal_name": "www.bbc.com"
},
{
  "headline": "BBC finds electrocuted, drowned and starved cats in online torture groups",
  "url": "https://www.bbc.com/news/articles/c5yp9w5kyw7o",
  "body": "An international network that shares online videos of cats and kittens being tortured has members in the UK, the BBC has found.\nThe network is thought to have thousands of members who post, share and sell graphic images and videos of cats being hurt and killed.\nIn one group, on an encrypted messaging app, the BBC found evidence of British members suggesting users adopt kittens from the RSPCA to mutilate.\nThe BBC investigation comes after two teenagers admitted torturing and killing two kittens in a park in Ruislip, north-west London, in May. They are due to be sentenced on Monday.\nThe following report contains graphic content and descriptions of animal cruelty.\nThe 16-year-old girl, and boy, aged 17, who cannot be named for legal reasons, pleaded guilty after the kittens were found cut open and strung up. Knives, blowtorches and scissors were also found at the scene.\nIt is understood that police are now looking into possible links to a wider network of cat torturers who film, post and sell footage of attacks on encrypted messaging apps.\nThese groups started in China, but BBC News has identified members now active across the world, including in the UK.\nThe scale of the network has been documented by animal rights activists Feline Guardians.\nThe group says between May 2023 and May 2024, a new video showing the torture and execution of a kitten or cat was uploaded approximately every 14 hours.\nIt says it has documented 24 groups active this year, the largest of which had more than 1,000 members. The most active torturer is believed to have filmed the torture and killing of more than 200 cats.\nChat conversations in one group, seen by the BBC, include what appear to be UK-based accounts discussing how to get hold of cats to abuse.\nOne member discussed how to adopt kittens from the RSPCA and posted application forms. Another post shared an advert for kittens for sale in the UK, posting that they wanted to \"torture them so bad\".\nLara is a volunteer with Feline Guardians. We have agreed not to use her full name for fear of reprisals.\nShe said: \"Every day I feel heartbroken, there is not a day that goes past that I don't feel like my heart is breaking.\"\nShe has spent time undercover in the forums and says there is no limit to the pain the torturers are prepared to inflict.\nShe describes it as the \"depths of evil\".\nVideos and photographs seen by the BBC are graphic and extremely disturbing.\nThey include footage of cats being drowned and electrocuted. One video speculates on how long a kitten in a cage will survive if it is not given food.\nGroup members appear to want to inflict as much pain as possible. In online chats, torturers explain how they use electrocution to resuscitate a cat in order to prolong suffering.\nNew members are encouraged to mutilate and post videos to gain access to a wider network.\nThe BBC saw evidence that suggested children were taking part in these groups. One member posted: \"I'm 10 years old and I like to torture cats.\"\nIn September 2023, the network even promoted a \"100 cat kill\" competition, during which members were encouraged to see how quickly the group could torture and kill 100 cats.\nVideos depicting the horrific torture of cats first went viral in China in 2023.\nThe man responsible for two extremely graphic videos, Wang Chaoyi, was detained for 15 days by the Chinese authorities and forced to issue a \"letter of repentance\".\nBut his footage developed a cult following and others began making similar content for Chinese and Western social media, gaining thousands of views, before groups developed on encrypted messaging apps.\nOne website even describes itself as a place for the \"cat-lover community\" and requests viewers \"submit your work\".\nUsers can only gain access if they provide evidence of their own cat torture.\nWho is Little Winnie?\n\"Little Winnie\" is a well known name used in the cat torture community for having a profile picture that mocks the Chinese leader Xi Jinping with an image of Winnie the Pooh.\nAccounts with that name and profile picture are described as administrators in a number of forums.\nAn activist from Feline Guardians got in touch with one of those Little Winnie accounts and lured the man behind it into an online relationship.\n\"I felt disgusted having to be friendly and then having to have this friendship with him,\" the activist, who does not want to be named, said.\nShe communicated for several weeks and infiltrated the network.\n\"It was just an endless scroll of torture videos, one after the other,\" she said. \"I felt, 'I just can't watch this'. Even though I'm messaging him, I can't watch this. I had to sort of turn off my brain.\"\nEventually she persuaded the man behind the account to do a video call. From that call, the group identified a 27-year-old man living in the Japanese capital Tokyo.\nWhen contacted by the BBC, the man said he categorically denied any involvement in these activities.\nLara, from Feline Guardians, told us that law enforcement and governments need to tackle the groups, saying \"it will only continue to expand and get worse\".\nFeline Guardians has held demonstrations outside the Chinese Embassy, in London, demanding that authorities in Beijing do more.\n\"In mainland China, there are no laws that are stopping this. So that means that abusers and torturers can effectively do what they want and live out these very sadistic fantasies without any consequence. These videos are then uploaded, and essentially that's a global problem, because that means that everyone has access to these videos. Children are seeing this,\" Lara said.\nIan Briggs, head of the RSPCA's special operations unit, told the BBC: \"Treating animals in this way is absolutely not acceptable and has no place in a modern society that is largely made up of kind, compassionate animal lovers.\"\nJohanna Baxter MP, chair of the All Party Parliamentary Group on Cats, said these groups were \"a deeply worrying trend, particularly among young men\".\n\"Animal abuse often acts as a gateway, making future acts of violence easier to rationalise and commit,\" she added.",
  "scraped_at": "2025-08-04T19:39:24.064374",
  "portal_name": "www.bbc.com"
},
{
  "headline": "I was paralysed after a skiing accident - now I'm a racing driver",
  "url": "https://www.bbc.com/news/articles/c74dxmw0lj3o",
  "body": "Three years ago, Ally Chalmers was standing on the podium after coming second in a national skiing competition. Just a fortnight later, he was lying in hospital, paralysed from the waist down after a devastating crash on the slopes.\nNow 17, the Glasgow teenager has made history by becoming Scotland's first wheelchair-using racing car driver.\nHis Mini Cooper S has been specially adapted so he can use hand controls to accelerate and brake.\nAlly recently raced in the Scottish Mini Cooper Cup at Knockhill in Fife, one of the UK's most respected club-level motorsport events.\nIt was his first proper race and he was named runner-up Driver of the Day.\nThe teenager passed his Association of Racing Drivers (ARD) test earlier this year - the first wheelchair user in Scotland to do so - allowing him to compete in licensed events.\nAlly was skiing with his mum Carole and his brothers in Glencoe in March 2022 when he crashed. The accident left him with multiple injuries, including a broken back, neck, collarbone and ribs.\nHe has been through three years of rehab and hospital visits.\nCarole suggested motor racing as something Ally could take up to fill the gap left by skiing as he used to enjoy go-karting before his accident.\nOver the past two years, she has helped him become an accomplished racing driver.\nThe pair bought a Mini Cooper S and began converting it for racing. Working with companies around the UK and a firm called Minimax in Scotland, they stripped the vehicle and rebuilt it into a race-spec Mini that Ally could control entirely with his hands.\nTo be allowed to race, Ally had to prove that he would be able to get out the car on his own in 10 seconds if there was a crash or fire.\nHe and his mum also had to campaign for rule changes to allow drivers using hand controls to compete.\nAnd all the while, Ally was learning a completely new discipline from scratch.\nCarole said seeing Ally on the grid was \"incredible\" while Ally said: \"The adrenaline's quite fun.\"\nAlly sees his competitions as a very level playing field.\nOne of the things that makes motorsport stand out is that it gives disabled drivers the rare chance to compete directly against able-bodied teams on equal terms.\n\"With other sports there are specialist groups for a reason but with racing there's no need if you have a hand-controlled car,\" he said.\n\"I've always loved competing,\" he said. \"Getting back into sport after my accident has been huge for me.\"\nScott MacKenzie, team principal at Minimax, said: \"Ally's been really good, as soon as he got in the car nothing really phased him.\nScott said refitting the car was \"a fair bit of work, but exciting\".\nHowever, Ally declared that it was \"definitely not an easy ride\".\nUnlike most drivers, who use their feet for the clutch, accelerator and brake, he uses a set of controls built into the steering wheel area.\nAcceleration is managed by a ring he pulls to speed up. Gear changes are handled with two buttons – one for upshifting and one for downshifting and there's a lever near the steering column to brake.\nWhen you're doing 100 miles an hour round Knockhill, that's a lot to manage.\nAlly isn't stopping here. He's already planning more races and, if things go well, a career in professional motorsport.\n\"It's taken a lot of hard work and I've had the support of so many people,\" he said. \"I'm younger than a lot of the other drivers, so I'm proud of how the race went.\n\"I'm really looking forward to racing again and hopefully one day I can go professional.\"\nAlly's got his sights set on joining Team Brit, the world's only competitive team made up entirely of disabled racing drivers.\nBased in England, the team helps people with physical and mental challenges get into motorsport, using their own tech and years of know-how.\nThey hope to become the first all-disabled team to take on the Le Mans 24-hour endurance race and say they are building a proper pathway into racing for disabled drivers like Ally.\nCarole said: \"I knew, knowing Ally that, he would not be happy in life not having a sport that was as high adrenaline as ski racing was.\n\"It was important to me that he could continue to not just participate, but compete. There have been hurdles, but he's stayed focused on his goal and seeing him out there [on the race track] was amazing.\n\"He might be the first disabled race car driver in Scotland, but hopefully there'll be many more who follow him into the sport.\"",
  "scraped_at": "2025-08-04T19:39:27.606665",
  "portal_name": "www.bbc.com"
},
{
  "headline": "I regret taking my son to a riot following Southport attack, says stepmother",
  "url": "https://www.bbc.com/news/articles/c201e9qq9g6o",
  "body": "\"I have no answer for it other than I'm an idiot, stupid, got caught up in the moment,\" says Amy Hodgkinson-Hedgecox.\nShe is trying to explain how she - a mother to two children who lives in Tamworth, Staffordshire - attended a riot with her son, then aged 11.\nHodgkinson-Hedgecox is one of thousands of people to have been involved in violent protests that erupted last summer. The rioting followed the murder by a teenager of three young girls in Southport - Elsie Dot Stancombe, seven, Bebe King, six, and Alice da Silva Aguiar, nine.\nEight other children and two adults were also injured.\nA wave of misinformation, half-truths and lies on social media, including false claims that the killer was a Muslim asylum seeker, sparked riots in towns and cities across England and Northern Ireland. More than 1,800 people were arrested, and 698 were convicted of crimes such as violent disorder and assaulting police.\nA year on, angry protesters are once again gathering at hotels where asylum seekers are housed.\nBBC Panorama contacted hundreds of people who took part in riots last year to ask them how they account for their actions. Many would not speak to us, saying they did not trust mainstream media; others were too ashamed or scared.\nOnly a few agreed to talk. But while Hodgkinson-Hedgecox told Panorama her actions had been impulsive and she regretted them, another was unapologetic - defending his online calls to sink small boats and refusing to condemn rioters who set fire to the hotel where he was protesting.\nHodgkinson-Hedgecox, 38, is wearing an electronic tag around her ankle at the house she shares with her partner Charlotte and their two children. Sentenced to two years and three months in jail after pleading guilty to violent disorder, but now released on licence, she cannot leave the house between 19:00 and 07:00.\n\"It was really exciting,'' she says. \"The adrenaline was just… it was crazy. It was a real eye-opener that I would never do again.\"\nWith her distinctive short cropped hair, Hodgkinson-Hedgecox is easily identifiable in the reams of footage from that evening outside the hotel. She did not throw any missiles, she had no part in setting any fires, but she was standing in front of police lines shouting abuse at them, and making obscene gestures at the asylum seekers living in the hotel.\nBrady, now 12, had seen the protests on TikTok and repeatedly asked Hodgkinson-Hedgecox to take him there. She agreed.\nShe says she went there because she believed social media posts which said asylum seekers had been filming young girls at a park close to the hotel, near the centre of Tamworth. But Hodgkinson-Hedgecox acknowledges the claims may not have been true.\n\"I did swear. I was just shouting to the police, like, how would you like it if your child has been videoed by them? There's a level where you should be sticking up for us as well as them,\" she says.\n\"I was frustrated, I was really frustrated. Everybody's got an opinion on what's going on right now.\"\nThe former factory worker, with Brady at her side, stayed there as the violence escalated.\n\"When they started smashing the windows, they were throwing fireworks through the holes and they were going bang in the building, I thought, something bad's going to happen here,\" she says.\n\"As soon as I seen the lighter go on that petrol bomb I thought, oh my God, this building's going to go down. I was really concerned for [the people inside]. I thought, wow, this is gonna go up in flames, gonna kill them all. And it's not right, it's wrong. It's so wrong.\"\nHodgkinson-Hedgecox has been jailed several times. Until the riots, her last conviction, for battery, was in 2009. She says she has turned her life around since and is totally focused on her family.\n\"I accept that I was wrong for being there. I should never have been there. And I accept I should have never took a child with me either,\" she says. \"Massive regret, huge regret. It's bad parenting.\"\nPatriotic Alternative, a far-right, anti-immigration group run by former BNP activist Mark Collett contacted Hodgkinson-Hedgecox's partner Charlotte after she was jailed.\nIt offered her £1,000, saying it was providing financial support to the families of some of those convicted for their role in the rioting, describing them as political prisoners. Charlotte, who told us she was in a bad place after her partner was convicted, says she now regrets accepting the money.\nIn Rotherham, Ross Hart took part in a protest outside another asylum hotel. The 30-year-old says he was angry about the number of people arriving in the UK in small boats.\n\"All these migrants coming over, they get the hotels, they get their food,\" he says. \"They get everything they need to get set up. That comes out of taxpayers' money.\"\nThe protest began peacefully, but as it escalated, Hart was filmed joining men rocking a police van.\nIt was \"adrenaline\", \"a heat of the moment thing\", he says. \"Just show them that we've had enough and you need to listen to us.\"\nHart was also filmed vandalising one of the hotel's air conditioning units. \"At that time basically, only thing people cared about then were making sure they left that hotel. Long story short: get them out.\"\nJust as in Tamworth, rioters set fire to the hotel. Hart was not involved in the arson but he stood by and watched. And he admits to giving little thought to the plight of those trapped inside.\n\"I don't think none of that came into nobody's mind because enough's enough. No, I wouldn't say I wanted them to die, I wanted them gone.\"\nHart was jailed for two years and 10 months after pleading guilty to violent disorder. Like Hodgkinson-Hedgecox, he had been jailed as a teenager. Two years ago, he was also convicted for assaulting a woman.\nHart, who is unemployed, has anxiety, depression and borderline personality disorder. He says he was not taking his medication in the run up to the riots, but doubts it would have made much difference to his actions.\n\"I do believe if I'd have had my medication, I probably would have still been there,\" he says. \"But I don't think I have done anything at all, to be honest.\"\nRoss Hart, like Amy Hodgkinson-Hedgecox, has been released early on licence, but his views on asylum seekers have not been affected by his jailing. We showed him a social media image which appears to show migrants on a boat heading to the UK. It features a comment he posted: \"Sink the lot dirty rats\".\nWhen challenged about the offensive post, he says: \"There's nowt racist about that. To me, there's nowt wrong with that, what I've put there.\"\nThe anger over the housing of asylum seekers in hotels has not gone away. At least 12 people were charged after violence broke out at a protest outside an Essex hotel last month.\n\"Social media has got a lot to answer for and personally, do I think it's gonna happen again? Yeah, absolutely I do,\" says Hodgkinson-Hedgecox. \"Would I attend? No, definitely not. Do I believe everything that I read on social media now? No. I really, really don't.\"\n\"I'm a quiet person now, I've got a quiet life. I just wanna move forward from this, learn from my mistakes, and just go back to being the family person that I am.\"\nOne target of the 2024 riots - Southport Imam Ibrahim Hussein, whose mosque was attacked - says he has forgiven those rioters who have written to him to apologise. But Mr Hussein says the fear has not gone away for many Muslims like him.\n\"I'm afraid it's like if you crack a big piece of glass, it's very hard to put it back,\" he says. \"It is a scary time when you are labelled for what you believe.\"\nGet our flagship newsletter with all the headlines you need to start the day. Sign up here.",
  "scraped_at": "2025-08-04T19:39:29.836051",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Watch: Twin waterspouts merge near Italian coastline",
  "url": "https://www.bbc.com/news/videos/c70xex71zpzo",
  "body": "Strong gusts of wind helped two huge waterspouts merge just off Italy's Delta del Po, on the country's east coast.\nA local tour boat operator paused an excursion so he could film the spectacle.\nWaterspouts are similar to tornadoes that occur over water. Around 500 occur in Europe every year, according to data from the European severe weather database.",
  "scraped_at": "2025-08-04T19:39:31.983242",
  "portal_name": "www.bbc.com"
},
{
  "headline": "BBC finds electrocuted, drowned and starved cats in online torture groups",
  "url": "https://www.bbc.com/news/articles/c5yp9w5kyw7o",
  "body": "An international network that shares online videos of cats and kittens being tortured has members in the UK, the BBC has found.\nThe network is thought to have thousands of members who post, share and sell graphic images and videos of cats being hurt and killed.\nIn one group, on an encrypted messaging app, the BBC found evidence of British members suggesting users adopt kittens from the RSPCA to mutilate.\nThe BBC investigation comes after two teenagers admitted torturing and killing two kittens in a park in Ruislip, north-west London, in May. They are due to be sentenced on Monday.\nThe following report contains graphic content and descriptions of animal cruelty.\nThe 16-year-old girl, and boy, aged 17, who cannot be named for legal reasons, pleaded guilty after the kittens were found cut open and strung up. Knives, blowtorches and scissors were also found at the scene.\nIt is understood that police are now looking into possible links to a wider network of cat torturers who film, post and sell footage of attacks on encrypted messaging apps.\nThese groups started in China, but BBC News has identified members now active across the world, including in the UK.\nThe scale of the network has been documented by animal rights activists Feline Guardians.\nThe group says between May 2023 and May 2024, a new video showing the torture and execution of a kitten or cat was uploaded approximately every 14 hours.\nIt says it has documented 24 groups active this year, the largest of which had more than 1,000 members. The most active torturer is believed to have filmed the torture and killing of more than 200 cats.\nChat conversations in one group, seen by the BBC, include what appear to be UK-based accounts discussing how to get hold of cats to abuse.\nOne member discussed how to adopt kittens from the RSPCA and posted application forms. Another post shared an advert for kittens for sale in the UK, posting that they wanted to \"torture them so bad\".\nLara is a volunteer with Feline Guardians. We have agreed not to use her full name for fear of reprisals.\nShe said: \"Every day I feel heartbroken, there is not a day that goes past that I don't feel like my heart is breaking.\"\nShe has spent time undercover in the forums and says there is no limit to the pain the torturers are prepared to inflict.\nShe describes it as the \"depths of evil\".\nVideos and photographs seen by the BBC are graphic and extremely disturbing.\nThey include footage of cats being drowned and electrocuted. One video speculates on how long a kitten in a cage will survive if it is not given food.\nGroup members appear to want to inflict as much pain as possible. In online chats, torturers explain how they use electrocution to resuscitate a cat in order to prolong suffering.\nNew members are encouraged to mutilate and post videos to gain access to a wider network.\nThe BBC saw evidence that suggested children were taking part in these groups. One member posted: \"I'm 10 years old and I like to torture cats.\"\nIn September 2023, the network even promoted a \"100 cat kill\" competition, during which members were encouraged to see how quickly the group could torture and kill 100 cats.\nVideos depicting the horrific torture of cats first went viral in China in 2023.\nThe man responsible for two extremely graphic videos, Wang Chaoyi, was detained for 15 days by the Chinese authorities and forced to issue a \"letter of repentance\".\nBut his footage developed a cult following and others began making similar content for Chinese and Western social media, gaining thousands of views, before groups developed on encrypted messaging apps.\nOne website even describes itself as a place for the \"cat-lover community\" and requests viewers \"submit your work\".\nUsers can only gain access if they provide evidence of their own cat torture.\nWho is Little Winnie?\n\"Little Winnie\" is a well known name used in the cat torture community for having a profile picture that mocks the Chinese leader Xi Jinping with an image of Winnie the Pooh.\nAccounts with that name and profile picture are described as administrators in a number of forums.\nAn activist from Feline Guardians got in touch with one of those Little Winnie accounts and lured the man behind it into an online relationship.\n\"I felt disgusted having to be friendly and then having to have this friendship with him,\" the activist, who does not want to be named, said.\nShe communicated for several weeks and infiltrated the network.\n\"It was just an endless scroll of torture videos, one after the other,\" she said. \"I felt, 'I just can't watch this'. Even though I'm messaging him, I can't watch this. I had to sort of turn off my brain.\"\nEventually she persuaded the man behind the account to do a video call. From that call, the group identified a 27-year-old man living in the Japanese capital Tokyo.\nWhen contacted by the BBC, the man said he categorically denied any involvement in these activities.\nLara, from Feline Guardians, told us that law enforcement and governments need to tackle the groups, saying \"it will only continue to expand and get worse\".\nFeline Guardians has held demonstrations outside the Chinese Embassy, in London, demanding that authorities in Beijing do more.\n\"In mainland China, there are no laws that are stopping this. So that means that abusers and torturers can effectively do what they want and live out these very sadistic fantasies without any consequence. These videos are then uploaded, and essentially that's a global problem, because that means that everyone has access to these videos. Children are seeing this,\" Lara said.\nIan Briggs, head of the RSPCA's special operations unit, told the BBC: \"Treating animals in this way is absolutely not acceptable and has no place in a modern society that is largely made up of kind, compassionate animal lovers.\"\nJohanna Baxter MP, chair of the All Party Parliamentary Group on Cats, said these groups were \"a deeply worrying trend, particularly among young men\".\n\"Animal abuse often acts as a gateway, making future acts of violence easier to rationalise and commit,\" she added.",
  "scraped_at": "2025-08-04T19:39:34.127181",
  "portal_name": "www.bbc.com"
},
{
  "headline": "'There is nothing left' - British expat family forced to flee wildfire in Cyprus",
  "url": "https://www.bbc.com/news/articles/c99mxpy174vo",
  "body": "\"We just had to leave, and we didn't know what we were going to come back to.\"\nSpeaking from his in-laws home, Ben Armstrong, 38, has recalled the moment he and his wife, Lucy, 37, rounded up their three-year-old son, their three dogs and some belongings, and fled their home.\nThe couple, who have lived in Souni, Limassol, Cyprus, for about four years, said they had lost everything in the fire on 24 July which spread over 100 sq km (40 sq m) and killed two people.\nAccording to Cypriot police the blaze began in the village of Malia and more than 250 firefighters were deployed to battle the flames, which were fanned by strong winds and soaring temperatures.\n\"Everything is completely burnt, there is nothing left of my house at all, just the walls,\" said Ben, who is originally from Cardiff.\n\"It's unrecognisable,\" he added.\nBen moved to Cyprus to seek a better life, and to be with his wife, Lucy, 37, who was born in the UK but grew up in Cyprus.\nThe fire started off very small, Ben said, which he described as being \"nothing out of the ordinary for this time of the year\", but it quickly escalated.\nAs the flames grew closer, Ben said his \"biggest nightmare\" came to life as they realised they wouldn't be safe if they stayed at their home.\n\"The way it was moving, we had never seen a fire like this before.\"\nIn less than an hour Ben had notified as many neighbours as he could, and the family rounded up a small amount of their belongings.\nThere was no service, no sirens or present fire service, and Ben said one of the worst parts was feeling like they were on their own.\n\"We had no electricity, no water at this point. We were just rooting around in the dark with little lights to try and find bags and clothes,\" he said.\nWith a bag in his hands, Ben told his three-year-old son Ethan to \"pick a few of his favourite toys\" to take with them.\n\"Usually he's not a very compliant kid, but actually this time I think he knew in our voices and he was scared as well.\"\n\"We knew if we left it any longer, we could be trapped,\" he added.\nAs the flames closed in on either side, he said they drove away from their home not knowing what would be left when they returned.\n\"For me, my biggest nightmare was having a fire closing in on you, and it's on you to get everyone out safely.\n\"That's all I cared about, was that Lucy and Ethan were safe and we could get out in time so nothing happened,\" he said.\nThey all managed to escape, but when they returned their house was just ashes.\nIn Souni alone 93 homes burnt down as a result of the fire, which Ben described as being \"out of control\".\nLucy and Ethan are currently sick dealing with the effects of smoke inhalation, Ben said, adding \"we are just trying to keep positive for Ethan\".\n\"The house is where my son took his first few steps, it's where he learned to ride a bike.\n\"A lot of memories have disappeared in that fire.\"\nDespite their hopes that some of their possessions may have been saved, most sentimental items were burnt including the rope tie from their wedding ceremony in October last year, Lucy's wedding dress and wedding jewellery.\nAs an owner of a children's entertainment company, Ben also said his wife Lucy lost all of her supplies and is having to start her business from scratch.\n\"You start looking around and realise that what you've got is the bags and the clothes in the car you're driving off with, and that's it.\"\nSince the incident the family-of-six have been living with Lucy's parents in Ypsonas, Limassol, and say they have been taking each day as it comes.\nWhile they await more information from the government and their insurance about what support will be available to them, Ben's brother has started a fundraising page to help the family get back on their feet.\nHe added the support and donations from the community around them has been \"amazing\".\n\"The emotional part was all the help people were giving to us.\n\"We cannot thank people enough,\" he said, adding: \"You never expect yourself to be one of these people in need, but it's been unbelievable.\n\"These villages and these communities, what makes them so special is the fact that they all look after each other.\"",
  "scraped_at": "2025-08-04T19:39:36.276299",
  "portal_name": "www.bbc.com"
},
{
  "headline": "'He definitely has it', so why did Lewis Hamilton say he was useless?",
  "url": "https://www.bbc.com/sport/formula1/articles/cx2xgl37zdyo",
  "body": "- Published\nLewis Hamilton insisted he \"still loves\" Formula 1 after his most challenging weekend of his Ferrari career so far at the Hungarian Grand Prix.\nOn Saturday, Hamilton had said he was \"just useless\" after the seven-time champion qualified 12th on the grid, while his team-mate Charles Leclerc took Ferrari's first grand prix pole position of the season.\nOn Sunday, Hamilton finished in the same place, while Leclerc, after fighting with the race-winning McLarens for the first two-thirds of the race, faded to fourth place, his car apparently afflicted by a problem in the final stint.\nHamilton said he felt \"the same\" as he had after qualifying. He said: \"There's a lot going on in the background that is not… great, so…\" But added: \"I'm sure there are positives to take from the weekend and I'm sure there's learnings.\"\nAs is often the case when Hamilton struggles, not only does his mood plumb the depths, but the F1 rumour mill spins into overdrive.\nWas Hamilton over the hill, some wondered after qualifying? Would he even quit Ferrari at the end of the year, or perhaps even before the end of the season?\nThat one, at least, Hamilton rejected, saying he would be back in the car at the Dutch Grand Prix at the end of August after F1's summer break.\n\"I'm looking forward to coming back,\" he said. \"Hopefully, I'll be back, yeah.\"\nAnyone who knows Hamilton, and his determination, and refusal to give up, knows the answers to the other questions about his future, too.\nLeclerc's performance, in the wake of some upgrades on the Ferrari car at least gives him some room for optimism.\n\"Definitely some improvements that have been made on the upgrades,\" Hamilton said. \"Naturally, it's a shame we're not as competitive as the guys at the front, but you've seen Charles has had a really strong run of the last two races.\n\"The car is definitely progressing, so we have to keep trying to extract more from it.\"\nWhat does his boss think?\nTeam principal Frederic Vasseur injected some perspective into Hamilton's situation.\n\"For sure when you are seven-times world champion, your team-mate is in pole position and you are out in Q2, it's a tough situation,\" Vasseur said.\nOn the race result, Vasseur pointed out that Ferrari had gambled on a one-stop strategy starting on the hard tyre on a track where overtaking is notoriously difficult, and it \"didn't work\".\n\"I can understand the frustration from Lewis,\" he said, \"but this is normal, and he will come back.\"\nVasseur, who was instrumental in persuading Hamilton to leave Mercedes to join Ferrari for this season, pointed out that the results in Hungary made his driver's weekend look worse than it was.\nYes, Hamilton had been 0.247 seconds slower than Leclerc when he was knocked out of qualifying after the second session. But Leclerc himself had found it hard to progress, and Hamilton had been just 0.155secs adrift of his team-mate in the first session.\nThe past two races have seen a stall in the positive momentum Hamilton had been building after a difficult start to his Ferrari career.\nSince Miami in early May, there has been little to choose between the two drivers in qualifying, and Hamilton out-qualified Leclerc in three of the four races before Belgium, a week before Hungary.\nTwo errors of different kinds in the qualifying sessions for the sprint and grand prix at Spa made Hamilton look uncompetitive when he was anything but.\nHamilton was a match for Leclerc on pace in Belgium, but an off followed by a spin caused by a combination of factors relating to a new braking material saw him out in the first session in sprint qualifying. And the same thing happened when he misjudged the exit of the 180mph+ swerves at Eau Rouge and went slightly outside track limits in qualifying for the grand prix.\nEven with the problems in Belgium and Hungary, and the need to adapt to a new car of very different characteristics at the start of the season, Hamilton's average qualifying deficit to Leclerc is 0.146 seconds this year.\nThat's not what Hamilton would expect of himself, but it should be viewed in the context that Ferrari - and many others in F1 - regard Leclerc as the fastest driver over a single lap in the world.\nHamilton's critics point to his struggles against George Russell in his final season at Mercedes last year.\nThe 40-year-old has found the ground-effect cars introduced into F1 in 2022 do not fit his late-braking style as well as the previous generation of cars. And it does remain a mystery that he has not been able to adapt as well as would have been expected, or apparently as well as other drivers.\nBut Vasseur rejected any idea that he might be worried about Hamilton's situation.\n\"He's demanding,\" Vasseur said, \"but I think it's also why he's seven-times world champion, that he's demanding with the team, with the car, with the engineers, with the mechanics, with myself also. But first of all he's very demanding with himself.\"\n- Published21 hours ago\n- Published1 day ago\nWhat does his former boss think?\nToto Wolff, Hamilton's former team boss at Mercedes, was asked about Hamilton's downbeat self-assessment.\n\"That is Lewis wearing his heart on the sleeve,\" he said. \"It's what he thought very much when he was asked after the session. It was very raw.\n\"He was doubting himself, and we had it in the past when he felt that he underperformed his own expectations and your team-mate is on pole, and he's been that emotionally transparent since he was a young boy or young adult.\"\nAs for Hamilton's general performances, Wolff said: \"He's the GOAT, and he will always be the GOAT, and nobody's going to take that away. That's something he needs to always remember, that he's the greatest of all times.\n\"Lewis has unfinished business in Formula 1. In the same way that Mercedes underperformed over this latest set of regulations since 2022, we kind of never got happy with ground-effect cars. And in the same way, it bit him.\n\"Maybe it's linked to driving style. So he shouldn't go anywhere. Next year is brand new cars, completely different to drive, new power-units that need an intelligent way of managing the energy.\"\nCan Hamilton still win that elusive eighth title, Wolff was asked?\n\"If he has a car underneath him that he has confidence in, that does what he wants, then yes,\" he replied.\n\"If he has a car that it's not giving him the feedback that he wants, and that was the Mercedes of the past few years, and that seems to be the Ferrari, and even worse, then not.\n\"But you ask me whether he has it, he definitely has it.\"\nRelated topics\n- Published24 July",
  "scraped_at": "2025-08-04T19:39:38.407322",
  "portal_name": "www.bbc.com"
},
{
  "headline": "I was paralysed after a skiing accident - now I'm a racing driver",
  "url": "https://www.bbc.com/news/articles/c74dxmw0lj3o",
  "body": "Three years ago, Ally Chalmers was standing on the podium after coming second in a national skiing competition. Just a fortnight later, he was lying in hospital, paralysed from the waist down after a devastating crash on the slopes.\nNow 17, the Glasgow teenager has made history by becoming Scotland's first wheelchair-using racing car driver.\nHis Mini Cooper S has been specially adapted so he can use hand controls to accelerate and brake.\nAlly recently raced in the Scottish Mini Cooper Cup at Knockhill in Fife, one of the UK's most respected club-level motorsport events.\nIt was his first proper race and he was named runner-up Driver of the Day.\nThe teenager passed his Association of Racing Drivers (ARD) test earlier this year - the first wheelchair user in Scotland to do so - allowing him to compete in licensed events.\nAlly was skiing with his mum Carole and his brothers in Glencoe in March 2022 when he crashed. The accident left him with multiple injuries, including a broken back, neck, collarbone and ribs.\nHe has been through three years of rehab and hospital visits.\nCarole suggested motor racing as something Ally could take up to fill the gap left by skiing as he used to enjoy go-karting before his accident.\nOver the past two years, she has helped him become an accomplished racing driver.\nThe pair bought a Mini Cooper S and began converting it for racing. Working with companies around the UK and a firm called Minimax in Scotland, they stripped the vehicle and rebuilt it into a race-spec Mini that Ally could control entirely with his hands.\nTo be allowed to race, Ally had to prove that he would be able to get out the car on his own in 10 seconds if there was a crash or fire.\nHe and his mum also had to campaign for rule changes to allow drivers using hand controls to compete.\nAnd all the while, Ally was learning a completely new discipline from scratch.\nCarole said seeing Ally on the grid was \"incredible\" while Ally said: \"The adrenaline's quite fun.\"\nAlly sees his competitions as a very level playing field.\nOne of the things that makes motorsport stand out is that it gives disabled drivers the rare chance to compete directly against able-bodied teams on equal terms.\n\"With other sports there are specialist groups for a reason but with racing there's no need if you have a hand-controlled car,\" he said.\n\"I've always loved competing,\" he said. \"Getting back into sport after my accident has been huge for me.\"\nScott MacKenzie, team principal at Minimax, said: \"Ally's been really good, as soon as he got in the car nothing really phased him.\nScott said refitting the car was \"a fair bit of work, but exciting\".\nHowever, Ally declared that it was \"definitely not an easy ride\".\nUnlike most drivers, who use their feet for the clutch, accelerator and brake, he uses a set of controls built into the steering wheel area.\nAcceleration is managed by a ring he pulls to speed up. Gear changes are handled with two buttons – one for upshifting and one for downshifting and there's a lever near the steering column to brake.\nWhen you're doing 100 miles an hour round Knockhill, that's a lot to manage.\nAlly isn't stopping here. He's already planning more races and, if things go well, a career in professional motorsport.\n\"It's taken a lot of hard work and I've had the support of so many people,\" he said. \"I'm younger than a lot of the other drivers, so I'm proud of how the race went.\n\"I'm really looking forward to racing again and hopefully one day I can go professional.\"\nAlly's got his sights set on joining Team Brit, the world's only competitive team made up entirely of disabled racing drivers.\nBased in England, the team helps people with physical and mental challenges get into motorsport, using their own tech and years of know-how.\nThey hope to become the first all-disabled team to take on the Le Mans 24-hour endurance race and say they are building a proper pathway into racing for disabled drivers like Ally.\nCarole said: \"I knew, knowing Ally that, he would not be happy in life not having a sport that was as high adrenaline as ski racing was.\n\"It was important to me that he could continue to not just participate, but compete. There have been hurdles, but he's stayed focused on his goal and seeing him out there [on the race track] was amazing.\n\"He might be the first disabled race car driver in Scotland, but hopefully there'll be many more who follow him into the sport.\"",
  "scraped_at": "2025-08-04T19:39:40.553540",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Dozens of migrants die in boat capsize off Yemen",
  "url": "https://www.bbc.com/news/articles/cn84rrmlxvxo",
  "body": "At least 68 migrants have died after a boat with about 157 people on board sank off the coast of Yemen in bad weather.\nThe vessel capsized off Yemen's southern province of Abyan on Sunday, the Yemen chief for the International Organization for Migration (IOM) told the BBC. He said 12 people had been rescued, but dozens were unaccounted for.\nMost of the victims are believed to be Ethiopian nationals, said the IOM.\nYemen is a major pathway for migrants from the Horn of Africa travelling to Gulf states in search of work. The IOM estimates that hundreds have died or gone missing in shipwrecks in recent months.\nAbyan security officials said a large search-and-rescue mission had been launched and many bodies had been found across a wide area of shoreline.\nIOM Yemen chief Abdusattor Esoev said the boat was on a dangerous route in the vast coastal area often used by people smugglers.\nMr Esoev also emphasised the importance of strengthening legal safeguards for migrants, to prevent them from being exploited by smugglers.\n\"What we are advocating for all member states… is to enhance their regular pathways so people can take legal ways in order to migrate, instead of being trapped or deceived by smugglers and taking those dangerous journeys,\" he said.\nThe IOM previously described the journey from the Horn of Africa - composed of Somalia, Djibouti, Ethiopia and Eritrea - to Yemen as \"one of the busiest and most perilous mixed migration routes\". For many the final destination is Saudi Arabia.\nIn March, two boats carrying more than 180 migrants sank off the coast of Yemen's Dhubab district due to rough seas, with only two crew members rescued.\nMigrants arriving at Migrant Response Points in Yemen have also reported people-smugglers becoming more reckless by knowingly sending boats into dangerous conditions to avoid patrols, according to an IOM report.\nDespite the risks, many migrants continue to make the trip, with more than 60,000 arriving in Yemen in 2024 alone.\nIn the last decade, the IOM's Missing Migrants Project recorded more than 3,400 deaths and missing people along the route - 1,400 of those deaths were due to drowning.\nYemen remains engulfed in a devastating civil war which has lasted more than a decade. The Iran-backed Houthi group has controlled much of north-western Yemen since 2014, when they ousted the internationally-recognised government from the capital, Sanaa.\nGo to BBCAfrica.com for more news from the African continent.\nFollow us on Twitter @BBCAfrica, on Facebook at BBC Africa or on Instagram at bbcafrica",
  "scraped_at": "2025-08-04T19:39:42.681563",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Democrats flee Texas to block Republican redistricting map backed by Trump",
  "url": "https://www.bbc.com/news/articles/cz601p6jv8vo",
  "body": "Democratic state lawmakers have fled Texas to try to stop a vote on a new congressional map that would heavily favour Republicans.\nThe proposed redistricting - unveiled by Texas's majority Republicans last week and backed by President Donald Trump - would create five new Republican-leaning seats in the US House of Representatives. Republicans currently have only a slender majority in the House.\nTwo-thirds of the 150-member state legislature must be present in order to hold a vote. Fifty-one Democratic lawmakers have fled Texas, most of them to Illinois, denying Republicans the required quorum.\nThey said they plan to stay away for two weeks until the end of a special legislative session.\nThat session was convened by the Texas Governor Greg Abbott, who is a Republican himself. He has threatened to try to remove from office any lawmakers who fail to return to Texas for a vote.\nThe session in the Texas legislature is being held to provide disaster relief after last month's deadly floods in the state, and to ban THC, the active ingredient in cannabis - as well as approving the planned electoral redistricting.\nEach of the 51 absent lawmakers could face a $500 (£380) fine for every day they are away, and Texas Attorney General Ken Paxton, a Republican, has threatened to have them arrested.\nPaxton wrote on X that the state should \"use every tool at our disposal to hunt down those who think they are above the law\".\n\"Democrats in the Texas House who try and run away like cowards should be found, arrested, and brought back to the Capitol immediately,\" he added.\nIn a statement, Texas Democrats defended the move.\n\"We're not walking out on our responsibilities,\" said state legislator and chairman of the Democratic caucus Gene Wu.\n\"We're walking out on a rigged system that refuses to listen to the people we represent.\"\nState Democrats received the backing of national party figures. House Minority Leader Hakeem Jeffries said the group were showing \"courage, conviction and character\".\nWhile Democrats nationwide have threatened tit-for-tat tactics, their options may be limited.\nIn states where they handle the redistricting process, such as Illinois, New Mexico and Nevada, Democrats have already gerrymandered just as eagerly as Republicans.\nThe most recent Illinois map, for example, received an F grade from the Princeton Gerrymandering Project because it was rated so politically unfair.\nBut in other Democratic-controlled states, such as New York, California, Colorado and Washington, redistricting is handled by non-partisan, independent commissions, rather than the state legislatures.\nTexas Republicans currently hold 25 out of 38 congressional seats in the Lone Star State.\nThey hope the new maps could increase that number to 30 - all in constituencies that Trump won last November by at least 10 points.\nAhead of next year's nationwide midterm elections, Texas' redistricting could help pad the slender Republican majority in the House, which is the lower chamber of Congress.\nTrump's party currently has 219 of 435 seats in the House, while Democrats hold 212.\nThe new map would include a redistricting of the Rio Grande Valley and combine two districts in the state capital of Austin currently held by Democrats.\nIn northern Texas, the map would expand a district currently held by Democratic congresswoman Julie Johnson to include rural Republican strongholds.\nIt would also redraw four Houston-area seats, including one held by Democratic congressman Al Green.\nTexas state legislator Todd Hunter, a Republican who sponsored the measure to redraw the map, called it \"a good plan for Texas\".\nThis is the third time in the past few years that Democrats have fled Texas to deny Republicans a quorum.\nThe party's legislators took off for to Washington DC in 2021 in an ultimately unsuccessful attempt to block the passage of new election rules.\nTexas Democrats also left for Oklahoma in 2003 in a bid to stop redistricting that Republicans eventually managed to get approved.\nStates typically undergo redistricting every 10 years, when voting maps are redrawn to account for population changes.\nThe most recent US Census was in 2020. Redrawing district lines in the middle of a decade is unusual.",
  "scraped_at": "2025-08-04T19:39:44.817142",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Boeing defence workers go on strike in new blow to aviation giant",
  "url": "https://www.bbc.com/news/articles/c4gze2medkdo",
  "body": "More than three thousand Boeing defence workers went on strike on Monday, in a fresh blow to the embattled aviation giant.\nIt comes after union members at operations in Missouri and Illinois, who build F-15 fighter jets and other military aircraft, voted against the firm's latest offer over pay, work schedules and pensions.\n\"We're disappointed our employees rejected an offer that featured 40% average wage growth\", Dan Gillian, who is the vice president of Boeing's Air Dominance unit, said in a statement.\nBoeing is struggling to turn itself around after a series of problems, including safety issues and a damaging almost eight-week walkout by passenger plane workers last year.\nThe walkout is being led by a local branch of the International Association of Machinists and Aerospace Workers (IAM) based in St Louis, where Boeing's defence manufacturing hub is located.\n\"3,200 highly-skilled IAM Union members at Boeing went on strike at midnight because enough is enough. This is about respect and dignity, not empty promises,\" the union posted on X.\nIAM is one of America's largest unions, representing roughly 600,000 members in the aerospace, defence, shipbuilding and manufacturing industries.\nIt is the first walkout at Boeing's defence business since 1996, when work stopped for more than three months.\nBut last week Boeing's chief executive Kelly Ortberg downplayed the potential impact of the walkout.\nHe highlighted that it would be a lot smaller than a strike last year involving around 30,000 passenger jet workers that cost the firm billions of dollars.\n\"I wouldn't worry too much about the implications of the strike. We'll manage our way through that,\" said Mr Ortberg.\nBoeing has been hit by a series of crises in recent years, including two fatal crashes and a dramatic mid-air blowout of a piece of one of its planes.\nIn 2018, a Boeing 737 crashed after taking off from Jakarta, Indonesia, killing all 189 people on board. A few months later, another 157 people died when a Boeing plane crashed shortly after take-off in Ethiopia.\nSeparately in 2024, a panel fitted over an unused emergency exit of a Boeing 737 Max came off mid-flight.\nThe company delivered just 348 aircraft to its customers last year, its lowest output since the pandemic.",
  "scraped_at": "2025-08-04T19:39:47.417800",
  "portal_name": "www.bbc.com"
},
{
  "headline": "World-first gonorrhoea vaccine rollout begins in UK as infection rates soar",
  "url": "https://www.bbc.com/news/articles/cgkrx6dnkkeo",
  "body": "Gonorrhoea vaccines will be widely available from Monday in sexual health clinics across the UK, in a bid to tackle record-breaking levels of infections.\nThe jabs will first be offered to those at highest risk - mostly gay and bisexual men who have a history of multiple sexual partners or sexually transmitted infections.\nNHS England say the roll out is a world-first, and predict it could prevent as many as 100,000 cases, potentially saving the NHS almost £8m over the next decade.\nThe Terrence Higgins Trust, who campaigned for the vaccine to be introduced in the UK, told the BBC it was \"a huge win\" for sexual health.\nGonorrhoea is a bacterial infection that is transmitted through unprotected sex.\nSymptoms can include pain, unusual discharge, inflammation of the genitals and infertility, but in some cases it can have no symptoms at all.\nThe NHS says it can be avoided by the proper use of condoms and by accepting the vaccine if offered.\nDoctors are becoming increasingly worried about the number of infections, and hope the vaccine, which is 30-40% effective, will also help slow the growing number of antibiotic-resistant cases.\nThe vaccine, known as the 4CMenB vaccine, was designed for preventing meningitis B in babies, but the bacteria that causes the two diseases are so closely related that the jab is also effective against gonorrhoea.\nThere were more than 85,000 cases of gonorrhoea in 2023 - the highest since records began almost 100 years ago.\nOne of those diagnosed was Joey Knock, who says the infection gave him diarrhoea, made him feel \"wiped out\" and led to him taking time off work to recover.\nHe told BBC News: \"I discussed it with my friends and I definitely had worse symptoms [than them] with it.\n\"I felt really bad, I couldn't keep food down and I just felt totally run down.\"\nPrivate vaccination\nBecause he has many sexual partners, the 35-year-old decided to pay a private pharmacy for a course of gonorrhoea vaccinations in February 2024 before travelling abroad to a festival.\nHe paid £220 and says he's glad he did it.\n\"It helps knowing that I'm taking control of my sexual health and doing what I can to stay safe and practise safer sex and be much less worried about the severity of the symptoms,\" he says.\nJoey says he uses the protection the vaccine offers him alongside other methods of safer sex, including taking PrEP, a drug which helps prevent HIV, and DoxyPep - antibiotics taken after sex to prevent bacterial STIs, a treatment not widely available on the NHS.\nHe says he also occasionally uses condoms - but sees the vaccine as an extra tool to keep him safe in situations where he or his partner doesn't want to use them.\nSince being vaccinated, Joey has been re-infected with gonorrhoea but says the symptoms were much less severe.\nHe told the BBC: \"I've been able to get on with my day and it has just become something much more manageable, and getting tested regularly and knowing my body really helps too.\"\nMatthew, a 63-year-old from East Scotland, was diagnosed with gonorrhoea 10 years ago and had a reaction known as reactive arthritis - extreme pain in your joints caused by your body's reaction to an infection.\nHe told the BBC that the experience, which has caused lasting damage to some of his fingers and toes, was so painful it's left him fearful of becoming re-infected and has impacted his mental health.\nHe says: \"I'm constantly looking for symptoms and I'm constantly aware of it, and I feel a bit like I used to do in the 1980s when I was constantly fretting about HIV.\n\"I'd get some sort of cough and think 'oh my god, what's happening?'\"\nHe is hoping to be one of the first people to get a vaccine in order to give himself and his sexual partners more protection.\n\"You're not just protecting yourself, you're protecting your partners.\n\"I think it will also relieve some of the burden on sexual health services, it's getting difficult to get appointments so if it can work to reduce the incidence of STIs I think it's really worth it.\"\nRichard Angell, chief executive of the Terrence Higgins Trust, a leading sexual health charity, told the BBC the vaccine was a \"remarkable addition to our toolkit on sexual health\".\nDr Amanda Doyle, NHS national director for primary care and community services, said it was important \"everyone eligible takes up the offer through sexual health services\" in order to \"keep each other safe\".\n\"It's a real step forward for sexual health,\" she added.\nPeople who may be eligible for the vaccine are being asked to contact their local sexual health clinic for more information.",
  "scraped_at": "2025-08-04T19:39:49.545887",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Influential Indian tribal leader Shibu Soren dies at 81",
  "url": "https://www.bbc.com/news/articles/cvg3130l8kno",
  "body": "Shibu Soren, a prominent Indian tribal leader and a three-time chief minister of the eastern state of Jharkhand, has died at the age of 81.\nHe was undergoing treatment in Delhi for a kidney ailment and had been on life support after he suffered a stroke last month.\nIn a political career of more than 40 years, Soren co-founded the Jharkhand Mukti Morcha (JMM), an influential regional party that has been at the forefront of the creation of the tribal-dominated eastern state.\nHe became the chief minister of Jharkhand three times, but failed to complete his any of these terms in office due to political instability in the state.\nHis son Hemant Soren, who is the current chief minister of Jharkhand, announced the leader's death on Monday.\n\"Our respected Dishom Guru has left us, I have nothing left,\" he wrote on X, referring to Soren by his moniker, which means \"great leader\" in Santhali, the language spoken by the Santhal tribe – one of India's largest tribal communities.\nPrime Minister Narendra Modi led the tributes, calling Soren \"a grassroot leader who rose through the ranks of public life with unwavering dedication to the people\".\nBorn in 1944, Soren grew up in a small village in present-day Jharkhand at a time when the state was still a part of Bihar.\nHe founded the JMM in 1973 with the main objective to carve out a separate state for tribespeople from Bihar's southern districts.\nAfter Jharkhand was granted statehood in 2000, Soren became an influential figure in the region's politics.\nIn 2004, he became the federal coal minister in the Congress party's cabinet but quit a few months later, after he was convicted in a murder case.\nHe returned to the cabinet after getting bail later that year. In 2005, he resigned from the position to become the chief minister of Jharkhand, but had to step down within 10 days after his party failed to prove its majority in the state assembly.\nSoren was re-inducted into the federal government as the coal minister later that year. But he had to resign again, after he was convicted in another murder case, this time in connection with the kidnapping and murder of his personal secretary Shashinath Jha in 1994. He was eventually cleared of those charges in 2018.\nOn Monday, as the news of his death broke, leaders across political parties paid tributes to the leader.\nSenior Congress leader Jairam Ramesh called him \"the pivotal figure\" who led the movement for the creation of Jharkhand. \"He was truly a legend whose passion for social and economic justice was inspirational,\" Ramesh wrote on X.\n\"For the people of Jharkhand, he was no less than a god,\" said Sanjay Raut, a member of the influential Shiv Sena (UBT) party of Maharashtra state.\nFormer Bihar chief minister Lalu Prasad Yadav, who had opposed the creation of Jharkhand state but later allied with Soren, said his death was a matter of \"deep sorrow\" and called him a great leader who fought for the rights of tribespeople and Dalits (formerly untouchables).",
  "scraped_at": "2025-08-04T19:39:51.679173",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Democrats flee Texas to block Republican redistricting map backed by Trump",
  "url": "https://www.bbc.com/news/articles/cz601p6jv8vo",
  "body": "Democratic state lawmakers have fled Texas to try to stop a vote on a new congressional map that would heavily favour Republicans.\nThe proposed redistricting - unveiled by Texas's majority Republicans last week and backed by President Donald Trump - would create five new Republican-leaning seats in the US House of Representatives. Republicans currently have only a slender majority in the House.\nTwo-thirds of the 150-member state legislature must be present in order to hold a vote. Fifty-one Democratic lawmakers have fled Texas, most of them to Illinois, denying Republicans the required quorum.\nThey said they plan to stay away for two weeks until the end of a special legislative session.\nThat session was convened by the Texas Governor Greg Abbott, who is a Republican himself. He has threatened to try to remove from office any lawmakers who fail to return to Texas for a vote.\nThe session in the Texas legislature is being held to provide disaster relief after last month's deadly floods in the state, and to ban THC, the active ingredient in cannabis - as well as approving the planned electoral redistricting.\nEach of the 51 absent lawmakers could face a $500 (£380) fine for every day they are away, and Texas Attorney General Ken Paxton, a Republican, has threatened to have them arrested.\nPaxton wrote on X that the state should \"use every tool at our disposal to hunt down those who think they are above the law\".\n\"Democrats in the Texas House who try and run away like cowards should be found, arrested, and brought back to the Capitol immediately,\" he added.\nIn a statement, Texas Democrats defended the move.\n\"We're not walking out on our responsibilities,\" said state legislator and chairman of the Democratic caucus Gene Wu.\n\"We're walking out on a rigged system that refuses to listen to the people we represent.\"\nState Democrats received the backing of national party figures. House Minority Leader Hakeem Jeffries said the group were showing \"courage, conviction and character\".\nWhile Democrats nationwide have threatened tit-for-tat tactics, their options may be limited.\nIn states where they handle the redistricting process, such as Illinois, New Mexico and Nevada, Democrats have already gerrymandered just as eagerly as Republicans.\nThe most recent Illinois map, for example, received an F grade from the Princeton Gerrymandering Project because it was rated so politically unfair.\nBut in other Democratic-controlled states, such as New York, California, Colorado and Washington, redistricting is handled by non-partisan, independent commissions, rather than the state legislatures.\nTexas Republicans currently hold 25 out of 38 congressional seats in the Lone Star State.\nThey hope the new maps could increase that number to 30 - all in constituencies that Trump won last November by at least 10 points.\nAhead of next year's nationwide midterm elections, Texas' redistricting could help pad the slender Republican majority in the House, which is the lower chamber of Congress.\nTrump's party currently has 219 of 435 seats in the House, while Democrats hold 212.\nThe new map would include a redistricting of the Rio Grande Valley and combine two districts in the state capital of Austin currently held by Democrats.\nIn northern Texas, the map would expand a district currently held by Democratic congresswoman Julie Johnson to include rural Republican strongholds.\nIt would also redraw four Houston-area seats, including one held by Democratic congressman Al Green.\nTexas state legislator Todd Hunter, a Republican who sponsored the measure to redraw the map, called it \"a good plan for Texas\".\nThis is the third time in the past few years that Democrats have fled Texas to deny Republicans a quorum.\nThe party's legislators took off for to Washington DC in 2021 in an ultimately unsuccessful attempt to block the passage of new election rules.\nTexas Democrats also left for Oklahoma in 2003 in a bid to stop redistricting that Republicans eventually managed to get approved.\nStates typically undergo redistricting every 10 years, when voting maps are redrawn to account for population changes.\nThe most recent US Census was in 2020. Redrawing district lines in the middle of a decade is unusual.",
  "scraped_at": "2025-08-04T19:39:53.811200",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Influential Indian tribal leader Shibu Soren dies at 81",
  "url": "https://www.bbc.com/news/articles/cvg3130l8kno",
  "body": "Shibu Soren, a prominent Indian tribal leader and a three-time chief minister of the eastern state of Jharkhand, has died at the age of 81.\nHe was undergoing treatment in Delhi for a kidney ailment and had been on life support after he suffered a stroke last month.\nIn a political career of more than 40 years, Soren co-founded the Jharkhand Mukti Morcha (JMM), an influential regional party that has been at the forefront of the creation of the tribal-dominated eastern state.\nHe became the chief minister of Jharkhand three times, but failed to complete his any of these terms in office due to political instability in the state.\nHis son Hemant Soren, who is the current chief minister of Jharkhand, announced the leader's death on Monday.\n\"Our respected Dishom Guru has left us, I have nothing left,\" he wrote on X, referring to Soren by his moniker, which means \"great leader\" in Santhali, the language spoken by the Santhal tribe – one of India's largest tribal communities.\nPrime Minister Narendra Modi led the tributes, calling Soren \"a grassroot leader who rose through the ranks of public life with unwavering dedication to the people\".\nBorn in 1944, Soren grew up in a small village in present-day Jharkhand at a time when the state was still a part of Bihar.\nHe founded the JMM in 1973 with the main objective to carve out a separate state for tribespeople from Bihar's southern districts.\nAfter Jharkhand was granted statehood in 2000, Soren became an influential figure in the region's politics.\nIn 2004, he became the federal coal minister in the Congress party's cabinet but quit a few months later, after he was convicted in a murder case.\nHe returned to the cabinet after getting bail later that year. In 2005, he resigned from the position to become the chief minister of Jharkhand, but had to step down within 10 days after his party failed to prove its majority in the state assembly.\nSoren was re-inducted into the federal government as the coal minister later that year. But he had to resign again, after he was convicted in another murder case, this time in connection with the kidnapping and murder of his personal secretary Shashinath Jha in 1994. He was eventually cleared of those charges in 2018.\nOn Monday, as the news of his death broke, leaders across political parties paid tributes to the leader.\nSenior Congress leader Jairam Ramesh called him \"the pivotal figure\" who led the movement for the creation of Jharkhand. \"He was truly a legend whose passion for social and economic justice was inspirational,\" Ramesh wrote on X.\n\"For the people of Jharkhand, he was no less than a god,\" said Sanjay Raut, a member of the influential Shiv Sena (UBT) party of Maharashtra state.\nFormer Bihar chief minister Lalu Prasad Yadav, who had opposed the creation of Jharkhand state but later allied with Soren, said his death was a matter of \"deep sorrow\" and called him a great leader who fought for the rights of tribespeople and Dalits (formerly untouchables).",
  "scraped_at": "2025-08-04T19:39:55.973098",
  "portal_name": "www.bbc.com"
},
{
  "headline": "India win all-time classic despite Woakes heroics",
  "url": "https://www.bbc.com/sport/cricket/articles/cx279ylegeyo",
  "body": "- Published\nFifth Rothesay Test, The Kia Oval (day five of five)\nIndia 224 (Nair 57, Atkinson 5-33, Tongue 3-57) & 396 (Jaiswal 118; Tongue 5-125)\nEngland 247 (Crawley 64; Krishna 4-62, Siraj 4-86) & 367 (Brook 111, Root 105; Siraj 5-104)\nIndia won by six runs; draw series 2-2\nEngland were denied a record-breaking run chase by an irresistible India, who snatched victory by six runs in one of the most dramatic conclusions in Test cricket history.\nIn scenes that will go down in British sporting folklore, Chris Woakes came out to bat with his arm in a sling to support Gus Atkinson when England needed 17 to reach their target of 374.\nWoakes was given a hero's welcome, then stood at the non-striker's end as Atkinson attempted to swipe England to victory.\nAmid almost unbearable tension at The Oval, Atkinson and Woakes somehow tried to inch England on, surrounded by the deafening din of the febrile Indian support.\nAfter Atkinson clobbered Mohammed Siraj for six, Woakes ran a bye to wicketkeeper Dhruv Jurel, who missed the stumps, in order for Atkinson to pinch the strike.\nIndia kept the field back. Prasidh Krishna bowled the next over. Woakes was able to run a two, then another vital single off the final ball to leave Atkinson with the strike.\nBut Atkinson was bowled by the brilliant Siraj, giving India their narrowest victory in terms of runs in a Test.\nIt left one of the greatest series ever played level at 2-2, concluding 25 days of outstanding sporting theatre.\nAt the end of a fractious series, India broke off from the delirious celebrations to commiserate with Woakes, then embarked on a lap of honour, soaking up a historic win with their jubilant fans.\n- Published31 minutes ago\nLion-hearted Woakes cannot deny superb Siraj\nIf the fourth day of this Test was astonishing for its fluctuations and high emotion, the fifth day provided drama that was barely believable.\nEngland's target of 374 represented their second highest successful chase in Tests and the highest ever on this ground. They began Monday on 339-6, 35 adrift.\nJamie Smith and Jamie Overton were being given a torrid time on Sunday before the weather ended play early. England's task instantly looked easier on Monday when Overton pulled Krishna's first ball of the day for four and followed by inside-edging the next delivery past his stumps to the fine-leg fence.\nThe runs required were down to 27, then the pendulum swung once more.\nSmith looked all at sea. He played and missed at his first two balls from Siraj and edged his third. There was a wait to see if Jurel had pouched the catch, but there was no doubt.\nAtkinson edged the first ball he faced, inches short of KL Rahul at second slip. India's fans, comfortably outnumbering the England support, surrounded the ground with noise.\nSiraj charged in again. Overton played all around his pad. Umpire Kumar Dharmasena took so long to raise his finger, Overton had completed a run. The England man was so sure the review would save him, he began to mark his guard, only for the replay to show umpire's call for shaving the leg stump. India were delirious.\nAtkinson was unsure whether to farm the strike or trust Josh Tongue. The sky got darker and floodlights took hold. Tongue was given leg before to Krishna, but the review showed the ball missing leg stump. England still needed 19.\nEngland had added two more when Tongue was bowled by Krishna. There was confusion as to whether Woakes would bat, then came the sight of the 36-year-old walking down the dressing-room stairs with his left arm covered by his England sweater.\nWoakes ultimately never faced a ball, but his bravery will not be forgotten.\nAtkinson's mighty blow off Siraj was parried over the ropes by Akash Deep and left England with 11 to win. India captain Shubman Gill had the decision over bringing in the field to prevent the single, or to protect the boundary. He chose the latter. Woakes was in obvious pain when he shuffled the bye off the final ball of Siraj's over.\nAtkinson dug out Krishna for two to long-on, at the beginning of the next over. India kept the field back. England took another single. They needed seven when Siraj set off once more.\nAtkinson cleared his front leg again, attempting another heave to the leg side, but Siraj's yorker was pinpoint. He ended with 5-104, his effort every bit as heroic as the lion-hearted Woakes.\nEpic series plays out final act\nAfter the memorable fourth day was curtailed by the weather, there were concerns this series would not get the finale it deserves, played to a conclusion in front of empty seats.\nNot a bit of it. The Oval was sold out in advance and spectators made sure they were not late. They were rewarded with the epic ending, one that had echoes of the 2019 World Cup final, Ben Stokes at Headingley in the same year, or England's one-run defeat by New Zealand in Wellington two years ago.\nIt is a superb win for India, who deserve their 2-2 draw. They played this decisive Test without all of Rishabh Pant, Jasprit Bumrah and Nitish Kumar Reddy. This series may well be looked back on as the birth of a new team under Gill, who was prolific with the bat.\nEngland were without injured captain Stokes, then had to deal with the injury sustained by Woakes on day one. The home side had a patched up pace attack and first-choice spinner Shoaib Bashir is out with a broken finger.\nThe battered bodies reflects the gruelling nature of a gripping series, arguably the best to take place in this country since the iconic 2005 Ashes.\nWhat started with a stunning England run chase at Headingley moved to Gill's masterful batting at Edgbaston. England were taken to a tetchy victory at Lord's by the Herculean efforts of Stokes, then denied by India's gritty resistance at Old Trafford.\nAt various stages, Bashir bowled with a broken finger, Pant batted with a broken foot and Woakes batted with his dislocated shoulder. Neither team took a backward step and there were a number of flashpoint confrontations.\nBy the end, England missed out on a first series win against India since 2018 and their first win against any team in a five-Test series in the same time period.\nMore importantly, they failed in the first part of what they hoped would have been a glorious double, with the Ashes in Australia to come later this year.\nThe first Test in Perth is on 21 November. Woakes is already a huge doubt, and England face a nervous wait over the talismanic Stokes and key pace bowler Mark Wood.\nBefore then, they have white-ball contests at home to South Africa, then away in Ireland and New Zealand. None will match what we have witnessed over the past seven weeks. What a series.\n'An incredible series' - what they said\nEngland captain Ben Stokes speaking to Test Match Special: \"It's been an incredible series - the commitment and energy has been outstanding.\n\"We're bitterly disappointed we couldn't get the series win but myself being a massive advocate of the game of Test cricket, this series has been an unbelievable advert for it across the world. All the doubters saying it's dying a death, this series has said the opposite.\n\"For us, to come out here and try and chase that total down in the way that we did was outstanding. That never say die, never back down attitude we've installed in the group nearly paid off for us. We couldn't quite get over the line.\"\nIndia captain Shubman Gill: \"It means so much. This was a very hard-fought series. Both teams throwing punches and you could never really predict after day four who was going to win the match.\n\"We are a young team but before the start of the series, we spoke about how we didn't want to be looked at as a young team. We wanted to be a gun team and I think we showed that today.\"\nEngland batter Harry Brook: \"It is a great advert for Test cricket. To rock up with a crowd like this today when we needed 30-odd runs to win is phenomenal.\n\"I don't think we could get support like that in any other series, other than the Ashes.\n\"It has been awesome. The most enjoyable series I have played in. We have not left anything out on that pitch. We have been absolutely knackered. A very intense Test series, but a very enjoyable one.\"\nRelated topics\n- Published31 January",
  "scraped_at": "2025-08-04T19:39:58.121952",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Why Guardiola's new number two could be Man City's biggest summer signing",
  "url": "https://www.bbc.com/sport/football/articles/cm2ker2n476o",
  "body": "- Published\nManchester City have spent more than £150m on five new players this summer but Pep Guardiola's biggest signing did not cost a penny - and he will not play any football, either.\nIn early June, the second-most important coaching figure of Jurgen Klopp-era Liverpool became Guardiola's right-hand man at Manchester City.\nReally, it should have been a bigger news story, not least because hiring Pep Lijnders - a man credited with most of the day-to-day training under Klopp, as well as a substantial part of the German's tactical evolution post-Borussia Dortmund - suggests Guardiola is considering a major tactical overhaul.\nBut what's even more remarkable is that those tactical changes will be navigated with the substantial input of a coach who worked with Klopp on concepts like counter-pressing and attacking in vertical lines; on concepts that served as the antidote to Guardiola's famous positional play.\nThat contrast is often overstated, mind. Guardiola and Klopp borrowed from one another, and their shared peaks at Liverpool and Man City almost seem to merge into one perfect blend of Klopp's dynamism and Guardiola's control.\nOn the one hand Klopp's 'heavy metal' football was tamed by an appreciation of territorial dominance, on the other Guardiola used Klopp's ideas to adapt to the rough-and-tumble of Premier League life.\nNevertheless Lijnders, like Klopp, is far more concerned than Guardiola with aggressive, high-octane attacking football and the opportunities that open up when the ball changes hands.\nUntil now. Because from the outside looking in, Lijnders' appointment appears to confirm Guardiola thinks modern Premier League football is moving in the direction of the old Kloppites. And he's right.\nIt used to be the case that Guardiola's territorial suffocation would pin back inferior opponents but, as the middle-class teams got better, those who were bold enough to press hard and disrupt the build-up play started to see rewards.\nThey quite literally pushed back, until pressing hard and maximising transitions spread across the division and even Guardiola struggled to control things with slow passing and rigid positioning.\n\"Today, modern football is the way Bournemouth, Newcastle, Brighton and Liverpool play,\" Pep Guardiola told TNT Sports a few months ago. \"Modern football is not positional. You have to ride the rhythm.\"\nThat's a huge statement from the man whose 'positional play' tactical philosophy pretty much defined the past 15 years of the sport, but it's spot on.\nOver the past five years fast breaks and direct attacks are on the rise, while PPDA - a measure of pressing frequency and intensity, where a lower score means greater pressure - is going down.\nWhen Guardiola made those comments about modern football he was already beginning to experiment with a subtly more direct style of play.\nComparing their 2023-24 to 24-25 campaigns, City's possession share dropped from 65.5% to 61.3% while their total number of fast breaks jumped from 22 to 30, a rise of 36%.\nMost prominently, we saw more long balls from Ederson to bypass the opposition high press and more direct dribbling through the lines from January signing Omar Marmoush.\nMarmoush, by the looks of things, was the first signing of Man City 2.0: the rebuild that will shift Guardiola, Lijnders and City into a more Klopp-like direction. More players in that mould have since followed.\nRayan Cherki and Tijjani Reijnders have arrived from Lyon and AC Milan respectively and both signings, like Marmoush, point to more carrying of the ball through the lines and fewer neatly choreographed passing triangles.\nTo put it more simply, Cherki, Reijnders, and Marmoush are the kind of players who prefer to ride the rhythm.\nThe data here is stark. Compared with Man City's three most commonly used central midfielders in 2024-25, Cherki, Reijnders, and Marmoush scored considerably higher for 'progressive carries' (a carry of the ball at least five metres towards the opponent's goal) and 'attempted dribbles'.\nSigning Rayan Ait-Nouri also alludes to Klopp-esque - or Lijnders-esque – football, because having mostly deployed central midfielders or centre-backs in the full-back positions over the past two seasons - an obvious nod to control, order, and discipline - Guardiola has emphatically changed direction.\nAit-Nouri is one of the most attacking full-backs in Europe. Similar to the other three 2025 signings we have discussed, he ranked second for dribbles completed among defenders in the Premier League last season (63) and sixth among full-backs for progressive carries (89).\nBut more impressively, he was within the top three among defenders for goal involvements (11), expected assists (5.5) and touches in the opposition box (96).\nAit-Nouri's arrival tells us Guardiola is done with packing midfielders into the team and is ceding some control in favour of more urgent, vertical attacking football.\nJust like that, Manchester City fans can go from worrying about their team's slow and passive football to wondering how such an explosive attacking pair as Ait-Nouri and Jeremy Doku could work together on the left, or how Marmoush and Cherki will fit into the same attacking midfield space.\nThey will certainly have more questions than answers before the 2025-26 Premier League campaign gets under way, because most of their new arrivals - on the pitch and in the dugout - just don't fit the usual Pep archetype.\nClearly Guardiola is working on something new. With Lijnders at his side, it could be his sharpest left turn yet.",
  "scraped_at": "2025-08-04T19:40:00.565748",
  "portal_name": "www.bbc.com"
},
{
  "headline": "England-India Test series best since 2005 Ashes - Agnew",
  "url": "https://www.bbc.com/sport/cricket/articles/czerd60jweno",
  "body": "- Published\nThis series between England and India has definitely been the best that I have been involved in since the Ashes in 2005.\nWinning in Australia in 2010-11 was also special, but this has had all the ingredients that makes Test match cricket so special - the intensity, the combative nature at times, the immense skill.\nIt has had everything, it has been every bit as competitive and compelling as any Ashes series.\nOf course, England supporters would have loved Gus Atkinson to have scored those runs, even just six more for a tie, but to get a finish like that - regardless of who wins - is absolutely great for Test cricket.\nI've enjoyed the competitive nature throughout, it is what Test cricket is all about.\nYou don't see it in T20 or franchise cricket. It shows how much people and the players care about Test cricket and playing for your country, you can tell the difference.\nThe 7,187 runs scored is the most in a five-Test series, and it is just the second time in the past 20 years that every game in a series of that length has gone to a final day.\nIf any administrator in the world game looks at this series and is considering four-day Tests as the way to go, they shouldn't be an administrator in cricket. That's all that needs to be said.\nWe had the fourth day on a Sunday at The Oval and it was absolutely packed, and a sellout on day five which is fabulous.\nAnd this morning, to see Chris Woakes hobbling down those steps at number 11, it was just pure drama.\nColin Cowdrey batted with a broken arm in 1963, though he also did not face a ball, but Paul Terry did when he faced West Indies with his arm in a sling in 1984.\nIt was a relief that Woakes managed to stay at the non-striker's end because I'm not sure how India would have bowled to him.\nIt's all well and good to say you go there and bounce it in at his shoulder or whatever, but it's not very nice when you are faced with that possibility as a bowler.\n- Published2 hours ago\nIf you go back to key moments in this match, particularly with 73 runs needed with seven wickets in hand, England should be winning from there.\nThere will be comments about Harry Brook's dismissal and I'll be one who says, really, was that necessary? With the game just within your grasp, the really hard-nosed professional attitude is that you win the game.\nJoe Root and Brook had just snatched the game away from them with such an incredible 195-run partnership.\nBut if you speak to Michael Vaughan and Sir Alastair Cook, people who have scored far many more Test runs than I have, they'll say they're OK with it, so an old-timer shrugs his shoulders and says 'fair enough'.\nBut Brook was the only one who could have seized the game in the manner that he did because Root just played in his quiet, professional way.\nHe has since said he regretted the shot got that him out and fair enough to him, it's big of him to say that. You just hope that next time, in Sydney when they're 2-1 up to win the Ashes, he'll see England home!\nAt the start of the series my worry was that if it didn't go well, all of England's carefully laid plans for Australia could be in a mess and you wouldn't know what they would do, going forward.\nBut it has not been the case at all. We have been choosing our starting XIs for the first Test in Perth and it is pretty much the same as it would be if we had sat down in May and answered the same question.\nThat is such a positive place to be - it sends a real message to Australia.\nIndia have been outstanding themselves, though. They have not helped themselves in the final match with their selection, but they still won.\nIf you think back to when they were 0-2 in Manchester at the start of their second innings, they have shown enormous resilience.\nThey are a new team and although Shubman Gill is very laid-back outwardly, he has a steely side to him - he reminds me of David Gower.\nHe will learn so much from this experience and they seem to have great spirit.\nJonathan Agnew was speaking to BBC Sport cricket writer Ffion Wynne.\nRelated topics\n- Published31 January",
  "scraped_at": "2025-08-04T19:40:02.715175",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Swiatek becomes latest seed to fall at Canadian Open",
  "url": "https://www.bbc.com/sport/tennis/articles/c62wz52ljj7o",
  "body": "- Published\nWimbledon champion Iga Swiatek became the latest seed to fall at the Canadian Open as she suffered a surprise defeat by Clara Tauson in the fourth round.\nDenmark's Tauson, ranked 19th, avenged her fourth-round loss to Swiatek at Wimbledon last month with a 7-6 (7-1) 6-3 victory over the second seed in Montreal.\nSwiatek's exit comes after top seed Coco Gauff, two-time defending champion Jessica Pegula and fourth seed Mirra Andreeva were all knocked out.\n\"Obviously it's really great and it shows all the hard work I've been doing has been the right thing,\" said Tauson, who won her third WTA title in January - her first since 2021.\n\"I'm getting more confidence in this kind of level and feeling like I belong here a bit more. I think that really helped me today in the important points.\"\nTauson will face Australian Open champion Madison Keys in the quarter-finals after the American saved two match points en route to a 4-6 6-3 7-5 win over Czech Karolina Muchova.\nEarlier on Sunday, four-time major winner Naomi Osaka lost only one game as she outplayed Latvia's Anastasija Sevastova to wrap up a 6-1 6-0 win in 49 minutes.\nJapan's Osaka, a winner twice at the US and Australian Opens, is seeking her first title since returning from maternity leave early in 2024.\nThe 27-year-old parted company with coach Patrick Mouratoglou after less than a year and is now working with Poland's Tomasz Wiktorowski, former coach of Swiatek.\n\"I had a solid plan coming in here and it just happened to work out pretty well,\" said Osaka, currently ranked 49 in the world.\nIn the men's event, Australian Alex de Minaur continued his fine form with a 6-2 4-6 6-4 win over American seventh seed Frances Tiafoe to reach the quarter-finals in Toronto.\nNinth seed De Minaur, who won the Washington Open a week ago, is looking to go one better than his runners-up spot in 2023.\nDenmark's Holger Rune, seeded fifth, suffered a surprise exit as he was beaten 6-4 2-6 3-6 by Alexei Popyrin.\nRelated topics\n- Published31 January",
  "scraped_at": "2025-08-04T19:40:04.880696",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Son poised to join LAFC for potential record fee",
  "url": "https://www.bbc.com/sport/football/articles/c0j9gqp09lyo",
  "body": "- Published\nSon Heung-min is expected to join Los Angeles FC for around £20m after announcing his departure from Tottenham over the weekend.\nThe forward revealed in a news conference on Saturday that he will leave Tottenham this summer after 10 years at the club.\nAnd the 33-year-old appears poised to join Major League Soccer (MLS) in what could even be a record fee, potentially surpassing the £22.5m paid by Atlanta United to sign Emmanuel Latte Lath from Middlesbrough in February.\nThe final details of the transfer remain in discussion but his move to LAFC is now considered subject just to the completion of paperwork and a medical.\nSon, who is under contract with Spurs until 2026, made what is expected to be his final appearance for Tottenham in a 1-1 pre-season friendly against Newcastle in Seoul on Sunday.\nHe was embraced by his Spurs team-mates and the opposing Newcastle players, and they performed a guard of honour when he was substituted in the 65th minute. While Tottenham's pre-season preparations now take them to Germany to face Bayern Munich on Thursday - and a reunion with Harry Kane -Son is expected to enjoy some time in his native South Korea.\nArriving from Bayer Leverkusen in 2015, Son scored 173 goals in 454 appearances for Tottenham.\nHe was captain when Tottenham beat Manchester United in the Europa League final in May to clinch their first trophy in 17 years.\nRelated topics\n- Published6 hours ago\n- Published2 days ago\n- Published26 July 2022",
  "scraped_at": "2025-08-04T19:40:07.033072",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Why Guardiola's new number two could be Man City's biggest summer signing",
  "url": "https://www.bbc.com/sport/football/articles/cm2ker2n476o",
  "body": "- Published\nManchester City have spent more than £150m on five new players this summer but Pep Guardiola's biggest signing did not cost a penny - and he will not play any football, either.\nIn early June, the second-most important coaching figure of Jurgen Klopp-era Liverpool became Guardiola's right-hand man at Manchester City.\nReally, it should have been a bigger news story, not least because hiring Pep Lijnders - a man credited with most of the day-to-day training under Klopp, as well as a substantial part of the German's tactical evolution post-Borussia Dortmund - suggests Guardiola is considering a major tactical overhaul.\nBut what's even more remarkable is that those tactical changes will be navigated with the substantial input of a coach who worked with Klopp on concepts like counter-pressing and attacking in vertical lines; on concepts that served as the antidote to Guardiola's famous positional play.\nThat contrast is often overstated, mind. Guardiola and Klopp borrowed from one another, and their shared peaks at Liverpool and Man City almost seem to merge into one perfect blend of Klopp's dynamism and Guardiola's control.\nOn the one hand Klopp's 'heavy metal' football was tamed by an appreciation of territorial dominance, on the other Guardiola used Klopp's ideas to adapt to the rough-and-tumble of Premier League life.\nNevertheless Lijnders, like Klopp, is far more concerned than Guardiola with aggressive, high-octane attacking football and the opportunities that open up when the ball changes hands.\nUntil now. Because from the outside looking in, Lijnders' appointment appears to confirm Guardiola thinks modern Premier League football is moving in the direction of the old Kloppites. And he's right.\nIt used to be the case that Guardiola's territorial suffocation would pin back inferior opponents but, as the middle-class teams got better, those who were bold enough to press hard and disrupt the build-up play started to see rewards.\nThey quite literally pushed back, until pressing hard and maximising transitions spread across the division and even Guardiola struggled to control things with slow passing and rigid positioning.\n\"Today, modern football is the way Bournemouth, Newcastle, Brighton and Liverpool play,\" Pep Guardiola told TNT Sports a few months ago. \"Modern football is not positional. You have to ride the rhythm.\"\nThat's a huge statement from the man whose 'positional play' tactical philosophy pretty much defined the past 15 years of the sport, but it's spot on.\nOver the past five years fast breaks and direct attacks are on the rise, while PPDA - a measure of pressing frequency and intensity, where a lower score means greater pressure - is going down.\nWhen Guardiola made those comments about modern football he was already beginning to experiment with a subtly more direct style of play.\nComparing their 2023-24 to 24-25 campaigns, City's possession share dropped from 65.5% to 61.3% while their total number of fast breaks jumped from 22 to 30, a rise of 36%.\nMost prominently, we saw more long balls from Ederson to bypass the opposition high press and more direct dribbling through the lines from January signing Omar Marmoush.\nMarmoush, by the looks of things, was the first signing of Man City 2.0: the rebuild that will shift Guardiola, Lijnders and City into a more Klopp-like direction. More players in that mould have since followed.\nRayan Cherki and Tijjani Reijnders have arrived from Lyon and AC Milan respectively and both signings, like Marmoush, point to more carrying of the ball through the lines and fewer neatly choreographed passing triangles.\nTo put it more simply, Cherki, Reijnders, and Marmoush are the kind of players who prefer to ride the rhythm.\nThe data here is stark. Compared with Man City's three most commonly used central midfielders in 2024-25, Cherki, Reijnders, and Marmoush scored considerably higher for 'progressive carries' (a carry of the ball at least five metres towards the opponent's goal) and 'attempted dribbles'.\nSigning Rayan Ait-Nouri also alludes to Klopp-esque - or Lijnders-esque – football, because having mostly deployed central midfielders or centre-backs in the full-back positions over the past two seasons - an obvious nod to control, order, and discipline - Guardiola has emphatically changed direction.\nAit-Nouri is one of the most attacking full-backs in Europe. Similar to the other three 2025 signings we have discussed, he ranked second for dribbles completed among defenders in the Premier League last season (63) and sixth among full-backs for progressive carries (89).\nBut more impressively, he was within the top three among defenders for goal involvements (11), expected assists (5.5) and touches in the opposition box (96).\nAit-Nouri's arrival tells us Guardiola is done with packing midfielders into the team and is ceding some control in favour of more urgent, vertical attacking football.\nJust like that, Manchester City fans can go from worrying about their team's slow and passive football to wondering how such an explosive attacking pair as Ait-Nouri and Jeremy Doku could work together on the left, or how Marmoush and Cherki will fit into the same attacking midfield space.\nThey will certainly have more questions than answers before the 2025-26 Premier League campaign gets under way, because most of their new arrivals - on the pitch and in the dugout - just don't fit the usual Pep archetype.\nClearly Guardiola is working on something new. With Lijnders at his side, it could be his sharpest left turn yet.",
  "scraped_at": "2025-08-04T19:40:09.184860",
  "portal_name": "www.bbc.com"
},
{
  "headline": "Green shoots for Man Utd or another false dawn?",
  "url": "https://www.bbc.com/sport/football/articles/ceqyj7lxznlo",
  "body": "- Published\nManchester United have been so underwhelming, so erratic and talked so many good games over the past decade without delivering, it is sensible to watch closely to see if any green shoots of recovery continue to grow before passing judgement.\nRuben Amorim is wise to this.\nHe knows his searingly honest appraisal of United and his welcome openness in outlining how he is trying to improve things will count for absolutely nothing if they lose to Arsenal at Old Trafford in their Premier League season opener on 17 August.\nHe also knows United tend to attract extreme reactions, and said as much after Sunday's 2-2 draw against Everton in Atlanta confirmed his side as winners of the four-team Premier League Summer Series.\n\"It's normal in our club,\" he said.\n\"If you play well, they will say we play really well, if it's on the opposite side, it's the same thing.\"\nAfter four minutes of speaking to the press - not even a sixth of the time he spent with travelling UK journalists in Chicago on Friday - he was gone, choosing instead to watch the non-starting members of his squad - Joshua Zirkzee, Noussair Mazraoui, Andre Onana and Lisandro Martinez were not involved at any point - do a full training session on the Mercedes-Benz Stadium pitch.\nWoe betide anyone who didn't meet Amorim's standards.\n- Published1 day ago\nIt is a big part of Amorim's coaching strategy to treat his players like adults. This seems sensible, although this is football we are talking about and even in Sir Alex Ferguson's day one player - who is still close to the club - turned up for a European trip with all his house keys, having locked the door with the rest of his family still inside, and had to sheepishly ask another employee to go back and let them out.\nThe sight of United players wandering round Chicago after training - either for a coffee, a bite to eat or a browse through the very expensive shops that make up the 'magnificent mile', without being accompanied by security, suggested a healthy dose of normality, which, as Amorim makes clear, comes with responsibility.\nPlayers posed for numerous selfies - plenty of fans asked and no-one refused - when they were out and about around the team hotel. Letting the dressing room run the dressing room served Ferguson well.\nIt has made for a more relaxed environment. This is a contrast to the prescriptive approach of Erik ten Hag, who punished players if they were late for meetings.\nThat is not to say punishments don't exist in Amorim's world.\nDefeat in the small-sided games at the end of training means having to pack away the training equipment. And in his revealing chat on Friday, Amorim said poor performance in training is identified and shown to the entire group rather than the individual concerned being singled out for a quiet word.\nThere are other subtleties too. Training on day one was at 8am to allow a transition through a six-hour time zone swap, in the knowledge Amorim will have his squad back together at Carrington on Wednesday before Saturday lunchtime's friendly with Fiorentina - disruption caused by a change in time zones should be easier.\nIt means Amorim was getting up even earlier to do his morning exercise, a run and weights, before the players arrived.\nTraining itself consisted of more intense gym work, lasting up to an hour, and walking through game scenarios - which Amorim takes and club media are not allowed to film.\nInformation is kept to key points rather than risk overload, where no messages get through. It is the general framework Amorim is trying to create. The players, he feels, should have the intelligence to make decisions themselves in key moments.\nThis means not all the key work takes place on the pitches. Amorim's assistant Carlos Fernandes does the set-pieces and drill work. The previous tradition of double sessions to build fitness have been ditched.\nIn addition, some of the running being asked of the players has been disguised. Two shooting drill stations were created at training but the gap between them was widened so more energy was expended to get between the two.\nOn the surface, all this seems positive. Certainly, reports from inside the club say the sports science team were delighted with the numbers from the early training sessions after Amorim's players returned for the start of pre-season on 7 July.\nThis, they reasoned, suggested the players had stuck to a pretty detailed and strict fitness programme to work on during their time off.\nThis is Manchester United, so there were some commercial appearances, but they have reduced from previous tours.\nIn fact, potentially the most significant commercial event as far as the club was concerned had no player involvement at all as Lord Coe, chair designate of the Mayoral Development Corporation (MDC) for the Old Trafford regeneration project, was part of a delegation who addressed an audience of Wall Street investment banks and US financiers in New York to try to generate interest in helping to fund the planned £2bn new stadium project.\nThe fact neither Coe nor chief operating officer Collette Roche, who spoke at length to travelling media about the stadium plans in Los Angeles 12 months earlier, met the press this time suggests strongly nothing significant has changed and the feeling is growing United will not meet an initial five-year timeline minority owner Sir Jim Ratcliffe spoke of in March.\nThat is not Amorim's concern, of course.\nHe must deliver on the pitch. And to that end, United did look much better than last season.\nIt was obvious the much-discussed three-man defence splits when Amorim's team have the ball so, when the build-up begins, the right and left-sided defenders operate as normal central defenders with the middle man of the three - Matthijs de Ligt is in pole position for that role - moves into midfield alongside the deeper of the two chosen for those jobs.\nMatheus Cunha definitely brings more invention to Amorim's attack and Amad Diallo, if selected, is a massive danger offensively at right wing-back, even if questions are asked defensively.\nIt is clear Amorim feels he can find an upgrade on Rasmus Hojlund, even if many would argue a better use of the funds United do have would be to find someone who can bring physicality and energy to midfield.\nWatching the industry of Bournemouth's Alex Scott emphasises it is a significant weakness in Amorim's squad.\nNevertheless, as tours go, this has been a fairly calm one. Amorim's group of players, in general, seem happy enough and the positive spirit needed for any team to be successful does exist.\nYet the reality of modern football is that everything in seen through, and judged by, the prism of results.\nThe walk through might be an advancement. If United win it will be seen that way. If they lose it will be written off as a terrible idea - even though it is the exactly the same process.\nConceding the winning goal to Tottenham in the Europa League final through a flick off Brennan Johnson - that took a deflection at close range off Luke Shaw and then squeezed in at the corner despite Onana's desperate attempt to keep it out - has nothing to do with training and everything to do with the small margins managers across the league talk about.\nThis does seem to be a better United. Amorim is getting his ideas across.\nBut Arsenal's upcoming visit to Old Trafford and the 37 Premier Leagues games afterwards will decide whether the progress is real or if pre-season 2025 was just another false dawn.\nRelated topics\n- Published26 July 2022",
  "scraped_at": "2025-08-04T19:40:11.354897",
  "portal_name": "www.bbc.com"
},
{
  "headline": "England-India Test series best since 2005 Ashes - Agnew",
  "url": "https://www.bbc.com/sport/cricket/articles/czerd60jweno",
  "body": "- Published\nThis series between England and India has definitely been the best that I have been involved in since the Ashes in 2005.\nWinning in Australia in 2010-11 was also special, but this has had all the ingredients that makes Test match cricket so special - the intensity, the combative nature at times, the immense skill.\nIt has had everything, it has been every bit as competitive and compelling as any Ashes series.\nOf course, England supporters would have loved Gus Atkinson to have scored those runs, even just six more for a tie, but to get a finish like that - regardless of who wins - is absolutely great for Test cricket.\nI've enjoyed the competitive nature throughout, it is what Test cricket is all about.\nYou don't see it in T20 or franchise cricket. It shows how much people and the players care about Test cricket and playing for your country, you can tell the difference.\nThe 7,187 runs scored is the most in a five-Test series, and it is just the second time in the past 20 years that every game in a series of that length has gone to a final day.\nIf any administrator in the world game looks at this series and is considering four-day Tests as the way to go, they shouldn't be an administrator in cricket. That's all that needs to be said.\nWe had the fourth day on a Sunday at The Oval and it was absolutely packed, and a sellout on day five which is fabulous.\nAnd this morning, to see Chris Woakes hobbling down those steps at number 11, it was just pure drama.\nColin Cowdrey batted with a broken arm in 1963, though he also did not face a ball, but Paul Terry did when he faced West Indies with his arm in a sling in 1984.\nIt was a relief that Woakes managed to stay at the non-striker's end because I'm not sure how India would have bowled to him.\nIt's all well and good to say you go there and bounce it in at his shoulder or whatever, but it's not very nice when you are faced with that possibility as a bowler.\n- Published2 hours ago\nIf you go back to key moments in this match, particularly with 73 runs needed with seven wickets in hand, England should be winning from there.\nThere will be comments about Harry Brook's dismissal and I'll be one who says, really, was that necessary? With the game just within your grasp, the really hard-nosed professional attitude is that you win the game.\nJoe Root and Brook had just snatched the game away from them with such an incredible 195-run partnership.\nBut if you speak to Michael Vaughan and Sir Alastair Cook, people who have scored far many more Test runs than I have, they'll say they're OK with it, so an old-timer shrugs his shoulders and says 'fair enough'.\nBut Brook was the only one who could have seized the game in the manner that he did because Root just played in his quiet, professional way.\nHe has since said he regretted the shot got that him out and fair enough to him, it's big of him to say that. You just hope that next time, in Sydney when they're 2-1 up to win the Ashes, he'll see England home!\nAt the start of the series my worry was that if it didn't go well, all of England's carefully laid plans for Australia could be in a mess and you wouldn't know what they would do, going forward.\nBut it has not been the case at all. We have been choosing our starting XIs for the first Test in Perth and it is pretty much the same as it would be if we had sat down in May and answered the same question.\nThat is such a positive place to be - it sends a real message to Australia.\nIndia have been outstanding themselves, though. They have not helped themselves in the final match with their selection, but they still won.\nIf you think back to when they were 0-2 in Manchester at the start of their second innings, they have shown enormous resilience.\nThey are a new team and although Shubman Gill is very laid-back outwardly, he has a steely side to him - he reminds me of David Gower.\nHe will learn so much from this experience and they seem to have great spirit.\nJonathan Agnew was speaking to BBC Sport cricket writer Ffion Wynne.\nRelated topics\n- Published31 January",
  "scraped_at": "2025-08-04T19:40:14.006770",
  "portal_name": "www.bbc.com"
},
{
  "headline": "British Broadcasting Corporation",
  "url": "https://www.bbc.com/",
  "body": "37 mins agoMiddle East\nOnly from the BBC\nGlobal News Podcast\nFar-right Israeli minister Ben-Gvir prays at al-Aqsa mosque compound, angering Arabs\nIt comes amid reports that PM Netanyahu is pushing to expand Israel's military operations in Gaza.",
  "scraped_at": "2025-08-04T19:40:14.009360",
  "portal_name": "www.bbc.com"
}
]